RuinaLab/Ranger/Robot_Nervous_System/LPC2xxx_Modules/mod_header/LPC2194_01.h
/***************************************************************************                        
 **    This file defines the Special Function Registers for	NXP LPC2194/01                         
 **    Modified (c) Copyright IAR Systems 2003   
 **        Modified by Seong-hee Lee (Emily)                               
 **    $Revision: 1.11.2.1 $   (Modified)
 **                                
 **    Note: Only little endian addressing of 8 bit registers.
 ***************************************************************************/

#ifndef LPC2194_01_H
#define LPC2194_01_H

typedef volatile unsigned char  REG8;
typedef volatile unsigned short REG16;
typedef volatile unsigned long  REG32;

/* External interrupt register */
typedef union{ 
struct {
  REG32 EINT0           :1;
  REG32 EINT1           :1;
  REG32 EINT2           :1;			  
  REG32 EINT3           :1;
  REG32 /**/            :28;
  } bit_extint;
 REG32 reg_extint;
} extint_bits;

/* External interrupt wakeup register */
typedef union{
struct {
  REG32 EXTWAKE0        :1;
  REG32 EXTWAKE1        :1;
  REG32 EXTWAKE2        :1;
  REG32 EXTWAKE3        :1;
  REG32 /**/            :28;
  }	bit_extwake;
  REG32	reg_extwake;
} extwake_bits;

/* External interrupt mode register */
typedef union{
struct {
  REG32 EXTMODE0        :1;
  REG32 EXTMODE1        :1;
  REG32 EXTMODE2        :1;
  REG32 EXTMODE3        :1;
  REG32 /**/            :28; 
  }	bit_extmode;
  REG32	reg_extmode;
} extmode_bits;

/* External interrupt polarity register */
typedef union{
struct {
  REG32 EXTPOLAR0        :1;
  REG32 EXTPOLAR1        :1;
  REG32 EXTPOLAR2        :1;
  REG32 EXTPOLAR3        :1;
  REG32 /**/             :28;
  }	bit_extpolar;
  REG32	reg_extpolar;
} extpolar_bits;

/* Memory mapping control register */
typedef union{
struct {
  REG32 MAP             :2;
  REG32 /**/            :30;
  }	bit_memmap;
  REG32	reg_memmap;
} memmap_bits;

/* PLL control register */
typedef union{
struct {
  REG32 PLLE            :1;
  REG32 PLLC            :1;
  REG32 /**/            :30;
  }	bit_pllcon;
  REG32	reg_pllcon;
} pllcon_bits;

/* PLL config register */
typedef union{
struct {
  REG32 MSEL            :5;
  REG32 PSEL            :2;
  REG32 /**/            :25;
  }	bit_pllcfg;
  REG32	reg_pllcfg;
} pllcfg_bits;

/* PLL status register */
typedef union{
struct {
  REG32 MSEL            :5;
  REG32 PSEL            :2;
  REG32 /**/            :1;
  REG32 PLLE            :1;
  REG32 PLLC            :1;
  REG32 PLOCK           :1;
  REG32 /**/            :21;
  }	bit_pllstat;
  REG32	reg_pllstat;
} pllstat_bits;

/* PLL feed register */
typedef union{
struct {
  REG32 FEED            :8;
  REG32 /**/            :24;
  }	bit_pllfeed;
  REG32	reg_pllfeed;
} pllfeed_bits;

/* Power control register */
typedef union{
struct {
  REG32 IDL             :1;
  REG32 PD              :1;
  REG32 /**/            :30;
  }	bit_pcon;
  REG32	reg_pcon;
} pcon_bits;

/* Power control for peripherals register LPC2194/01 */
typedef union{
struct {
  REG32 /**/            :1;
  REG32 PCTIM0          :1;
  REG32 PCTIM1          :1;
  REG32 PCURT0          :1;
  REG32 PCURT1          :1;
  REG32 PCPWM0          :1;
  REG32 /**/            :1;
  REG32 PCI2C           :1;
  REG32 PCSPI0          :1;
  REG32 PCRTC           :1;
  REG32 PCSPI1          :1;
  REG32 /**/            :1;
  REG32 PCAD            :1;
  REG32 PCCAN1          :1;
  REG32 PCCAN2          :1;
  REG32 PCCAN3          :1;
  REG32 PCCAN4          :1;
  REG32 /**/            :4;
  REG32 PCSSP           :1;
  REG32 /**/            :10;
  }	bit_pconp;
  REG32	reg_pconp;
} pconp_bits;

/* VPB divider register */
typedef union{
struct {
  REG32 VPBDIV          :2;
  REG32 /**/            :30;
  }	bit_vpbdiv;
  REG32	reg_vpbdiv;
} vpbdiv_bits;

/* Memory accelerator module control register */
typedef union{
struct {
  REG32 MODECTRL        :2;
  REG32 /**/            :30;
  }	bit_mamcr;
  REG32	reg_mamcr;
} mamcr_bits;

/* Memory accelerator module timing register */
typedef union{
struct {
  REG32 CYCLES          :3;
  REG32 /**/            :29;
  }	bit_mamtim;
  REG32	reg_mamtim;
} mamtim_bits;


/* VIC Interrupt registers */
typedef union{
struct {
  REG32 INT0            :1;
  REG32 INT1            :1;
  REG32 INT2            :1;
  REG32 INT3            :1;
  REG32 INT4            :1;
  REG32 INT5            :1;
  REG32 INT6            :1;
  REG32 INT7            :1;
  REG32 INT8            :1;
  REG32 INT9            :1;
  REG32 INT10           :1;
  REG32 INT11           :1;
  REG32 INT12           :1;
  REG32 INT13           :1;
  REG32 INT14           :1;
  REG32 INT15           :1;
  REG32 INT16           :1;
  REG32 INT17           :1;
  REG32 INT18           :1;
  REG32 INT19           :1;
  REG32 INT20           :1;
  REG32 INT21           :1;
  REG32 INT22           :1;
  REG32 INT23           :1;
  REG32 INT24           :1;
  REG32 INT25           :1;
  REG32 INT26           :1;
  REG32 INT27           :1;
  REG32 INT28           :1;
  REG32 INT29           :1;
  REG32 INT30           :1;
  REG32 INT31           :1;
  }	bit_vicint;
  REG32	reg_vicint;
} vicint_bits1,vicint_bits2,vicint_bits3,vicint_bits4,vicint_bits5,vicint_bits6,vicint_bits7,vicint_bits8;

/* VIC Vector control registers */
typedef union{
struct {
  REG32 NUMBER          :5;
  REG32 ENABLED         :1;
  REG32 /**/            :26;
  }	bit_vicvectcntl;
  REG32	reg_vicvectcntl;
} vicvectcntl_bits0,vicvectcntl_bits1,vicvectcntl_bits2,vicvectcntl_bits3,vicvectcntl_bits4,vicvectcntl_bits5,vicvectcntl_bits6,vicvectcntl_bits7,vicvectcntl_bits8,vicvectcntl_bits9,vicvectcntl_bits10,vicvectcntl_bits11,vicvectcntl_bits12,vicvectcntl_bits13,vicvectcntl_bits14,vicvectcntl_bits15;

/* VIC protection enable register */
typedef union{
struct {
  REG32 PROTECT         :1;
  REG32 /**/            :31;
  }	bit_vicprotection;
  REG32	reg_vicprotection;
} vicprotection_bits;



/* Pin function select register 0 */
typedef union{
struct {
  REG32 P0_0            :2;
  REG32 P0_1            :2;
  REG32 P0_2            :2;
  REG32 P0_3            :2;
  REG32 P0_4            :2;
  REG32 P0_5            :2;
  REG32 P0_6            :2;
  REG32 P0_7            :2;
  REG32 P0_8            :2;
  REG32 P0_9            :2;
  REG32 P0_10           :2;
  REG32 P0_11           :2;
  REG32 P0_12           :2;
  REG32 P0_13           :2;
  REG32 P0_14           :2;
  REG32 P0_15           :2;	
  }	bit_pinsel0;
  REG32	reg_pinsel0;
} pinsel0_bits;

/* Pin function select register 1 */
typedef union{
struct {
  REG32 P0_16           :2;
  REG32 P0_17           :2;
  REG32 P0_18           :2;
  REG32 P0_19           :2;
  REG32 P0_20           :2;
  REG32 P0_21           :2;
  REG32 P0_22           :2;
  REG32 P0_23           :2;
  REG32 P0_24           :2;
  REG32 P0_25           :2;
  REG32 P0_26           :2;
  REG32 P0_27           :2;
  REG32 P0_28           :2;
  REG32 P0_29           :2;
  REG32 P0_30           :2;
  REG32 P0_31           :2;
  }	bit_pinsel1;
  REG32	reg_pinsel1;
} pinsel1_bits;


/* GPIO register 0 */
typedef union{
struct {
  REG32 P0_0            :1;
  REG32 P0_1            :1;
  REG32 P0_2            :1;
  REG32 P0_3            :1;
  REG32 P0_4            :1;
  REG32 P0_5            :1;
  REG32 P0_6            :1;
  REG32 P0_7            :1;
  REG32 P0_8            :1;
  REG32 P0_9            :1;
  REG32 P0_10           :1;
  REG32 P0_11           :1;
  REG32 P0_12           :1;
  REG32 P0_13           :1;
  REG32 P0_14           :1;
  REG32 P0_15           :1;
  REG32 P0_16           :1;
  REG32 P0_17           :1;
  REG32 P0_18           :1;
  REG32 P0_19           :1;
  REG32 P0_20           :1;
  REG32 P0_21           :1;
  REG32 P0_22           :1;
  REG32 P0_23           :1;
  REG32 P0_24           :1;
  REG32 P0_25           :1;
  REG32 P0_26           :1;
  REG32 P0_27           :1;
  REG32 P0_28           :1;
  REG32 P0_29           :1;
  REG32 P0_30           :1;
  REG32 P0_31           :1;
  }	bit_gpio0;
  REG32	reg_gpio0;
} gpio0_bits1,gpio0_bits2,gpio0_bits3,gpio0_bits4;

/* FGPIO 0 Registers*/
typedef union{
union {
  struct{
    REG32 P0_0   : 1;
    REG32 P0_1   : 1;
    REG32 P0_2   : 1;
    REG32 P0_3   : 1;
    REG32 P0_4   : 1;
    REG32 P0_5   : 1;
    REG32 P0_6   : 1;
    REG32 P0_7   : 1;
    REG32 P0_8   : 1;
    REG32 P0_9   : 1;
    REG32 P0_10  : 1;
    REG32 P0_11  : 1;
    REG32 P0_12  : 1;
    REG32 P0_13  : 1;
    REG32 P0_14  : 1;
    REG32 P0_15  : 1;
    REG32 P0_16  : 1;
    REG32 P0_17  : 1;
    REG32 P0_18  : 1;
    REG32 P0_19  : 1;
    REG32 P0_20  : 1;
    REG32 P0_21  : 1;
    REG32 P0_22  : 1;
    REG32 P0_23  : 1;
    REG32 P0_24  : 1;
    REG32 P0_25  : 1;
    REG32 P0_26  : 1;
    REG32 P0_27  : 1;
    REG32 P0_28  : 1;
    REG32 P0_29  : 1;
    REG32 P0_30  : 1;
    REG32 P0_31  : 1;
  } addr0_w;

  struct
  {
    union
    {
      struct{
        REG8  P0_0   : 1;
        REG8  P0_1   : 1;
        REG8  P0_2   : 1;
        REG8  P0_3   : 1;
        REG8  P0_4   : 1;
        REG8  P0_5   : 1;
        REG8  P0_6   : 1;
        REG8  P0_7   : 1;
      } byte0_bit;
      REG8 byte0;
    } byte_0;
    union
    {
      struct{
        REG8  P0_8    : 1;
        REG8  P0_9    : 1;
        REG8  P0_10   : 1;
        REG8  P0_11   : 1;
        REG8  P0_12   : 1;
        REG8  P0_13   : 1;
        REG8  P0_14   : 1;
        REG8  P0_15   : 1;
      } byte1_bit;
      REG8 byte1;
    } byte_1;
    union
    {
      struct{
        REG8  P0_16   : 1;
        REG8  P0_17   : 1;
        REG8  P0_18   : 1;
        REG8  P0_19   : 1;
        REG8  P0_20   : 1;
        REG8  P0_21   : 1;
        REG8  P0_22   : 1;
        REG8  P0_23   : 1;
      } byte2_bit;
      REG8 byte2;
    } byte_2;
    union
    {
      struct{
        REG8  P0_24   : 1;
        REG8  P0_25   : 1;
        REG8  P0_26   : 1;
        REG8  P0_27   : 1;
        REG8  P0_28   : 1;
        REG8  P0_29   : 1;
        REG8  P0_30   : 1;
        REG8  P0_31   : 1;
      } byte3_bit;
      REG8 byte3;
    } byte_3;
  } addr0_b;

  struct
  {
    union
    {
      struct{
        REG16 P0_0   : 1;
        REG16 P0_1   : 1;
        REG16 P0_2   : 1;
        REG16 P0_3   : 1;
        REG16 P0_4   : 1;
        REG16 P0_5   : 1;
        REG16 P0_6   : 1;
        REG16 P0_7   : 1;
        REG16 P0_8   : 1;
        REG16 P0_9   : 1;
        REG16 P0_10  : 1;
        REG16 P0_11  : 1;
        REG16 P0_12  : 1;
        REG16 P0_13  : 1;
        REG16 P0_14  : 1;
        REG16 P0_15  : 1;
      } shortl_bit;
      REG16 shortl;
    } hw0;
    union
    {
      struct{
        REG16 P0_16   : 1;
        REG16 P0_17   : 1;
        REG16 P0_18   : 1;
        REG16 P0_19   : 1;
        REG16 P0_20   : 1;
        REG16 P0_21   : 1;
        REG16 P0_22   : 1;
        REG16 P0_23   : 1;
        REG16 P0_24   : 1;
        REG16 P0_25   : 1;
        REG16 P0_26   : 1;
        REG16 P0_27   : 1;
        REG16 P0_28   : 1;
        REG16 P0_29   : 1;
        REG16 P0_30   : 1;
        REG16 P0_31   : 1;
      } shortu_bit;
      REG16 shortu;
    } hw1;
  } addr0_hw;
 } bit_fgpio0;
 REG32 reg_fgpio0;
}fgpio0_bits1,fgpio0_bits2,fgpio0_bits3,fgpio0_bits4,fgpio0_bits5;

