RuinaLab/Ranger/Robot_Nervous_System/LPC2xxx_Modules/mod_header/LPC2194_01.h
/* GPIO register 1 */
typedef union{
struct {
  REG32 P1_0            :1;
  REG32 P1_1            :1;
  REG32 P1_2            :1;
  REG32 P1_3            :1;
  REG32 P1_4            :1;
  REG32 P1_5            :1;
  REG32 P1_6            :1;
  REG32 P1_7            :1;
  REG32 P1_8            :1;
  REG32 P1_9            :1;
  REG32 P1_10           :1;
  REG32 P1_11           :1;
  REG32 P1_12           :1;
  REG32 P1_13           :1;
  REG32 P1_14           :1;
  REG32 P1_15           :1;
  REG32 P1_16           :1;
  REG32 P1_17           :1;
  REG32 P1_18           :1;
  REG32 P1_19           :1;
  REG32 P1_20           :1;
  REG32 P1_21           :1;
  REG32 P1_22           :1;
  REG32 P1_23           :1;
  REG32 P1_24           :1;
  REG32 P1_25           :1;
  REG32 P1_26           :1;
  REG32 P1_27           :1;
  REG32 P1_28           :1;
  REG32 P1_29           :1;
  REG32 P1_30           :1;
  REG32 P1_31           :1;
  }	bit_gpio1;
  REG32	reg_gpio1;
} gpio1_bits1,gpio1_bits2,gpio1_bits3,gpio1_bits4;

/* FGPIO 1 Registers*/
typedef union{
union{
  struct {
    REG32 P1_0   : 1;
    REG32 P1_1   : 1;
    REG32 P1_2   : 1;
    REG32 P1_3   : 1;
    REG32 P1_4   : 1;
    REG32 P1_5   : 1;
    REG32 P1_6   : 1;
    REG32 P1_7   : 1;
    REG32 P1_8   : 1;
    REG32 P1_9   : 1;
    REG32 P1_10  : 1;
    REG32 P1_11  : 1;
    REG32 P1_12  : 1;
    REG32 P1_13  : 1;
    REG32 P1_14  : 1;
    REG32 P1_15  : 1;
    REG32 P1_16  : 1;
    REG32 P1_17  : 1;
    REG32 P1_18  : 1;
    REG32 P1_19  : 1;
    REG32 P1_20  : 1;
    REG32 P1_21  : 1;
    REG32 P1_22  : 1;
    REG32 P1_23  : 1;
    REG32 P1_24  : 1;
    REG32 P1_25  : 1;
    REG32 P1_26  : 1;
    REG32 P1_27  : 1;
    REG32 P1_28  : 1;
    REG32 P1_29  : 1;
    REG32 P1_30  : 1;
    REG32 P1_31  : 1;
  } addr1_w;

  struct
  {
    union
    {
      struct{
        REG8  P1_0   : 1;
        REG8  P1_1   : 1;
        REG8  P1_2   : 1;
        REG8  P1_3   : 1;
        REG8  P1_4   : 1;
        REG8  P1_5   : 1;
        REG8  P1_6   : 1;
        REG8  P1_7   : 1;
      } byte0_bit;
      REG8 byte0;
    } byte_0;
    union
    {
      struct{
        REG8  P1_8    : 1;
        REG8  P1_9    : 1;
        REG8  P1_10   : 1;
        REG8  P1_11   : 1;
        REG8  P1_12   : 1;
        REG8  P1_13   : 1;
        REG8  P1_14   : 1;
        REG8  P1_15   : 1;
      } byte1_bit;
      REG8 byte1;
    } byte_1;
    union
    {
      struct{
        REG8  P1_16   : 1;
        REG8  P1_17   : 1;
        REG8  P1_18   : 1;
        REG8  P1_19   : 1;
        REG8  P1_20   : 1;
        REG8  P1_21   : 1;
        REG8  P1_22   : 1;
        REG8  P1_23   : 1;
      } byte2_bit;
      REG8 byte2;
    } byte_2;
    union
    {
      struct{
        REG8  P1_24   : 1;
        REG8  P1_25   : 1;
        REG8  P1_26   : 1;
        REG8  P1_27   : 1;
        REG8  P1_28   : 1;
        REG8  P1_29   : 1;
        REG8  P1_30   : 1;
        REG8  P1_31   : 1;
      } byte3_bit;
      REG8 byte3;
    } byte_3;
  } addr1_b;

  struct
  {
    union
    {
      struct{
        REG16 P1_0   : 1;
        REG16 P1_1   : 1;
        REG16 P1_2   : 1;
        REG16 P1_3   : 1;
        REG16 P1_4   : 1;
        REG16 P1_5   : 1;
        REG16 P1_6   : 1;
        REG16 P1_7   : 1;
        REG16 P1_8   : 1;
        REG16 P1_9   : 1;
        REG16 P1_10  : 1;
        REG16 P1_11  : 1;
        REG16 P1_12  : 1;
        REG16 P1_13  : 1;
        REG16 P1_14  : 1;
        REG16 P1_15  : 1;
      } shortl_bit;
      REG16 shortl;
    } hw0;
    union
    {
      struct{
        REG16 P1_16   : 1;
        REG16 P1_17   : 1;
        REG16 P1_18   : 1;
        REG16 P1_19   : 1;
        REG16 P1_20   : 1;
        REG16 P1_21   : 1;
        REG16 P1_22   : 1;
        REG16 P1_23   : 1;
        REG16 P1_24   : 1;
        REG16 P1_25   : 1;
        REG16 P1_26   : 1;
        REG16 P1_27   : 1;
        REG16 P1_28   : 1;
        REG16 P1_29   : 1;
        REG16 P1_30   : 1;
        REG16 P1_31   : 1;
      } shortu_bit;
      REG16 shortu;
    } hw1;
  } addr1_hw;
 } bit_fgpio1;
 REG32 reg_fgpio1;
} fgpio1_bits1,fgpio1_bits2,fgpio1_bits3,fgpio1_bits4,fgpio1_bits5;

/* UART0 interrupt enable register */
typedef union{
struct {
  REG32 RDAIE        :1;
  REG32 THREIE       :1;
  REG32 RXLSIE       :1;
  REG32 /**/         :5;
  REG32 ABTOIntEn    :1;     
  REG32 ABEOintEn    :1;     
  REG32 /**/         :22;
  }	bit_uartier0;
  REG32	reg_uartier0;
} uartier0_bits;


/* UART1 interrupt enable register */
typedef union{
struct{
REG32 RDAIE      : 1;     
REG32 THREIE     : 1;     
REG32 RXLSIE     : 1;     
REG32 MSIE       : 1;     
REG32 /**/       : 3;     
REG32 CTSIE      : 1;     
REG32 ABTOIntEn  : 1;     
REG32 ABEOintEn  : 1;     
REG32 /**/       :22; 
  }	bit_uartier1;
  REG32	reg_uartier1;   
} uartier1_bits;

/* UART interrupt identification register and fifo control register */
typedef union{
union{
  //UxIIR
  struct {
REG32 IP       : 1;     
REG32 IID      : 3;     
REG32 /**/     : 2;     
REG32 IIRFE    : 2;     
REG32 ABEOInt  : 1;     
REG32 ABTOInt  : 1;     
REG32 /**/     :22;     
  } iir;                        
  //UxFCR                   
  struct {                  
REG32 FCRFE    : 1;     
REG32 RFR      : 1;     
REG32 TFR      : 1;     
REG32 /**/     : 3;     
REG32 RTLS     : 2;     
REG32 /**/     :24;     
  } fcr;		   
 }bit_uartfcriir;
  REG32	reg_uartfcriir;
} uartfcriir_bits0,uartfcriir_bits1;

/* UART line control register */
typedef union{
struct {
  REG8 WLS              :2;
  REG8 SBS              :1;
  REG8 PE               :1;
  REG8 PS               :2;
  REG8 BC               :1;
  REG8 DLAB             :1;	 
  }	bit_uartlcr;
  REG8	reg_uartlcr;
} uartlcr_bits0, uartlcr_bits1;

/* UART modem control register */
typedef union{
struct {
  REG8 DTR              :1;
  REG8 RTS              :1;
  REG8 /**/             :2;
  REG8 LMS              :1;
  REG8 /**/             :1;     
  REG8  RTSen           :1;     
  REG8  CTSen           :1;  
  }	bit_uartmcr;
  REG8	reg_uartmcr;
} uartmcr_bits;

/* UART line status register */
typedef union{
struct {
  REG8 DR               :1;
  REG8 OE               :1;
  REG8 PE               :1;
  REG8 FE               :1;
  REG8 BI               :1;
  REG8 THRE             :1;
  REG8 TEMT             :1;
  REG8 RXFE             :1;	 
  }	bit_uartlsr;
  REG8	reg_uartlsr;
} uartlsr_bits0,uartlsr_bits1;

/* UART modem status register */
typedef union{
//union {
  //U1MSR
  struct {
  REG8 DCTS             :1;
  REG8 DDSR             :1;
  REG8 TERI             :1;
  REG8 DDCD             :1;
  REG8 CTS              :1;
  REG8 DSR              :1;
  REG8 RI               :1;
  REG8 DCD              :1;
  }	bit_uartmsr;
  REG32	reg_uartmsr;
  } uartmsr_bits;
 /* //U1MSR ---- Not Used
  struct {
  REG8 MSR0             :1;
  REG8 MSR1             :1;
  REG8 MSR2             :1;
  REG8 MSR3             :1;
  REG8 MSR4             :1;
  REG8 MSR5             :1;
  REG8 MSR6             :1;
  REG8 MSR7             :1;	
  } bit_uartmsr;
  REG32 reg_uartmsr;
  }; 
} uartmsr_bits;	  */

/* UART Auto-baud Control Register */
typedef union{
struct{
REG32 ENA         : 1;     
REG32 MODE        : 1;     
REG32 RESTART     : 1;     
REG32 /**/        : 5;     
REG32 ABEOIntClr  : 1;     
REG32 ABTOIntClr  : 1;     
REG32 /**/        :22;    
  }	bit_uartacr;
  REG32	reg_uartacr;
} uartacr_bits0,uartacr_bits1;

/* UART Fractional Divider Register */
typedef union{
struct{
REG32 DivAddVal  : 4;     
REG32 MulVal     : 4;     
REG32 /**/       :24;     
  }	bit_uartfdr;
  REG32	reg_uartfdr;
} uartfdr_bits0,uartfdr_bits1;

