RuinaLab/Ranger/Robot_Nervous_System/LPC2xxx_Modules/mod_header/LPC2194_01.h
/* UART Transmit Enable Register */
typedef union{
struct{
REG8  /**/   : 7;     
REG8  TXENA  : 1;      
  }	bit_uartter;
  REG32	reg_uartter;
} uartter_bits0,uartter_bits1;

/* I2C control set register */
typedef union{
struct {
  REG32 /**/            :2;
  REG32 AA              :1;
  REG32 SI              :1;
  REG32 STO             :1;
  REG32 STA             :1;
  REG32 I2EN            :1;
  REG32 /**/            :25; 
  }	bit_i2conset;
  REG32	reg_i2conset;
} i2conset_bits;

/* I2C control clear register */
typedef union{
struct {
  REG32 /**/            :2;
  REG32 AAC             :1;
  REG32 SIC             :1;
  REG32 /**/            :1;
  REG32 STAC            :1;
  REG32 I2ENC           :1;
  REG32 /**/            :25; 
  }	bit_i2conclr;
  REG32	reg_i2conclr;
} i2conclr_bits;

/* I2C status register */
typedef union{
struct {
  REG32 STATUS          :8;
  REG32 /**/            :24; 
  }	bit_i2stat;
  REG32	reg_i2stat;
} i2stat_bits;

/* I2C data register */
typedef union{
struct {
  REG32 DATA            :8;
  REG32 /**/            :24; 
  }	bit_i2dat;
  REG32	reg_i2dat;
} i2dat_bits;

/* I2C slave address register */
typedef union{
struct {
  REG32 GC              :1;
  REG32 ADDR            :7;
  REG32 /**/            :24; 
  }	bit_i2adr;
  REG32	reg_i2adr;
} i2adr_bits;

/* I2C scl duty cycle register */
typedef union{
struct {
  REG32 COUNT           :16;
  REG32 /**/            :16;
  }	bit_i2scl;
  REG32	reg_i2scl;
} i2scl_bits1,i2scl_bits2;


/* SPI control register */
typedef union{
struct {
  REG32 /**/            :3;
  REG32 CPHA            :1;
  REG32 CPOL            :1;
  REG32 MSTR            :1;
  REG32 LSBF            :1;
  REG32 SPIE            :1;
  REG32 /**/            :24; 
  }	bit_spcr;
  REG32	reg_spcr;
} spcr_bits0,spcr_bits1;

/* SPI status register */
typedef union{
struct {
  REG32 /**/            :3;
  REG32 ABRT            :1;
  REG32 MODF            :1;
  REG32 ROVR            :1;
  REG32 WCOL            :1;
  REG32 SPIF            :1;
  REG32 /**/            :24; 
  }	bit_spsr;
  REG32	reg_spsr;
} spsr_bits0,spsr_bits1;

/* SPI data register */
typedef union{
struct {
  REG32 DATA            :8;
  REG32 /**/            :24;
  }	bit_spdr;
  REG32 reg_spdr;
} spdr_bits0,spdr_bits1;

/* SPI clock counter register */
typedef union{
struct {
  REG32 COUNTER         :8;
  REG32 /**/            :24;
  }	bit_spccr;
  REG32	reg_spccr;
} spccr_bits0,spccr_bits1;

/* SPI interrupt register */
typedef union{
struct {
  REG32 SPIINT          :1;
  REG32 /**/            :31; 
  }	bit_spint;
  REG32	reg_spint;
} spint_bits0,spint_bits1;


/* SSP Control Register 0 */
typedef union{
struct{
REG32 DSS   : 4;     
REG32 FRF   : 2;     
REG32 CPOL  : 1;     
REG32 CPHA  : 1;     
REG32 SCR   : 8;     
REG32 /**/  :16;   
  }	bit_sspcr0;
  REG32	reg_sspcr0;
} sspcr0_bits;

/* SSP Control Register 1 */
typedef union{
struct{
REG32 LBM  : 1;     
REG32 SSE  : 1;     
REG32 MS   : 1;     
REG32 SOD  : 1;     
REG32 /**/ :28;  
  }	bit_sspcr1;
  REG32	reg_sspcr1; 
} sspcr1_bits;

/* SSP Data Register */
typedef union{
struct{
REG32 DATA  :16;     
REG32 /**/  :16; 
  }	bit_sspdr;
  REG32	reg_sspdr;    
} sspdr_bits;

/* SSP Status Register */
typedef union{
struct{
REG32 TFE  : 1;     
REG32 TNF  : 1;     
REG32 RNE  : 1;     
REG32 RFF  : 1;     
REG32 BSY  : 1;     
REG32 /**/ :27;  
  }	bit_sspsr;
  REG32	reg_sspsr;  
} sspsr_bits;

/* SSP Clock Prescale Register */
typedef union{
struct{
REG32 CPSDVSR  : 8;     
REG32 /**/     :24; 
  }	bit_sspcpsr;
  REG32	reg_sspcpsr;   
} sspcpsr_bits;

/* SSP Interrupt Mask Set/Clear Register */
typedef union{
struct{
REG32 RORIM  : 1;     
REG32 RTIM   : 1;     
REG32 RXIM   : 1;     
REG32 TXIM   : 1;     
REG32 /**/   :28;  
  }	bit_sspimsc;
  REG32	reg_sspimsc; 
} sspimsc_bits;

/* SSP Raw Interrupt Status Register */
typedef union{
struct{
REG32 RORRIS  : 1;     
REG32 RTRIS   : 1;     
REG32 RXRIS   : 1;     
REG32 TXRIS   : 1;     
REG32 /**/    :28; 
  }	bit_sspris;
  REG32	reg_sspris;    
} sspris_bits;

/* SSP Masked Interrupt Status Register */
typedef union{
struct{
REG32 RORMIS  : 1;     
REG32 RTMIS   : 1;     
REG32 RXMIS   : 1;     
REG32 TXMIS   : 1;     
REG32 /**/    :28;
  }	bit_sspmis;
  REG32	reg_sspmis;    
} sspmis_bits;

/* SSP Interrupt Clear Register */
typedef union{
struct{
REG32 RORIC  : 1;     
REG32 RTIC   : 1;     
REG32 /**/   :30;
  }	bit_sspicr;
  REG32	reg_sspicr;    
} sspicr_bits;

/* CAN acceptance filter mode register */
typedef union{
struct {
  REG32 AccOff          :1;
  REG32 AccBP           :1;
  REG32 eFCAN           :1;
  REG32 /**/            :29; 
  }	bit_afmr;
  REG32	reg_afmr;
} afmr_bits;


/* CAN central transmit status register */
typedef union{
struct {
  REG32 TS              :4;
  REG32 /**/            :4;
  REG32 TBS             :4;
  REG32 /**/            :4;
  REG32 TCS             :4;
  REG32 /**/            :12; 
  }	bit_cantxsr;
  REG32	reg_cantxsr;
} cantxsr_bits;


/* CAN central receive status register */
typedef union{
struct {
  REG32 RS              :4;
  REG32 /**/            :4;
  REG32 RBS             :4;
  REG32 /**/            :4;
  REG32 DOS             :4;
  REG32 /**/            :12;
  }	bit_canrxsr;
  REG32	reg_canrxsr;
} canrxsr_bits;


/* CAN miscellaneous status register */
typedef union{
struct {
  REG32 ES              :4;
  REG32 /**/            :4;
  REG32 BS              :4;
  REG32 /**/            :20;
  }	bit_canmsr;
  REG32	reg_canmsr;
} canmsr_bits;


/* CAN mode register */
typedef union{
struct {
  REG32 RM              :1;
  REG32 LOM             :1;
  REG32 STM             :1;
  REG32 TPM             :1;
  REG32 SM              :1;
  REG32 RPM             :1;
  REG32 /**/            :1;
  REG32 TM              :1;
  REG32 /**/            :24; 
  }	bit_canmod;
  REG32	reg_canmod;
} canmod_bits1,canmod_bits2,canmod_bits3,canmod_bits4;


/* CAN command register */
typedef union{
struct {
  REG32 TR              :1;
  REG32 AT              :1;
  REG32 RRB             :1;
  REG32 CDO             :1;
  REG32 SRR             :1;
  REG32 STB1            :1;
  REG32 STB2            :1;
  REG32 STB3            :1;
  REG32 /**/            :24; 
  }	bit_cancmr;
  REG32	reg_cancmr;
} cancmr_bits1,cancmr_bits2,cancmr_bits3,cancmr_bits4;


