RuinaLab/Ranger/Robot_Nervous_System/LPC2xxx_Modules/mod_header/LPC2194_01.h
/* CAN global status register */
typedef union{
struct {
  REG32 RBS              :1;
  REG32 DOS              :1;
  REG32 TBS              :1;
  REG32 TCS              :1;
  REG32 RS               :1;
  REG32 TS               :1;
  REG32 ES               :1;
  REG32 BS               :1;
  REG32 /**/             :8;
  REG32 RXERR            :8;
  REG32 TXERR            :8; 
  }	bit_cangsr;
  REG32	reg_cangsr;
} cangsr_bits1,cangsr_bits2,cangsr_bits3,cangsr_bits4;


/* CAN interrupt capture register */
typedef union{
struct {
  REG32 RI               :1;
  REG32 TI1              :1;
  REG32 EI               :1;
  REG32 DOI              :1;
  REG32 WUI              :1;
  REG32 EPI              :1;
  REG32 ALI              :1;
  REG32 BEI              :1;
  REG32 IDI              :1;
  REG32 TI2              :1;
  REG32 TI3              :1;
  REG32 /**/             :5;
  REG32 ERRBIT           :5;
  REG32 ERRDIR           :1;
  REG32 ERRC             :2;
  REG32 ALCBIT           :5;
  REG32 /**/             :3; 
  }	bit_canicr;
  REG32	reg_canicr;
} canicr_bits1,canicr_bits2,canicr_bits3,canicr_bits4;


/* CAN interrupt enable register */
typedef union{
struct {
  REG32 RIE               :1;
  REG32 TIE1              :1;
  REG32 EIE               :1;
  REG32 DOIE              :1;
  REG32 WUIE              :1;
  REG32 EPIE              :1;
  REG32 ALIE              :1;
  REG32 BEIE              :1;
  REG32 IDIE              :1;
  REG32 TIE2              :1;
  REG32 TIE3              :1;
  REG32 /**/              :21;
  }	bit_canier;
  REG32	reg_canier;
} canier_bits1,canier_bits2,canier_bits3,canier_bits4;


/* CAN bus timing register */
typedef union{
struct {
  REG32 BRP                :10;
  REG32 /**/               :4;
  REG32 SJW                :2;
  REG32 TSEG1              :4;
  REG32 TSEG2              :3;
  REG32 SAM                :1;
  REG32 /**/               :8;
  }	bit_canbtr;
  REG32	reg_canbtr;
} canbtr_bits1,canbtr_bits2,canbtr_bits3,canbtr_bits4;


/* CAN error warning limit register */
typedef union{
struct {
  REG32 EWL                :8;
  REG32 /**/               :24;
  }	bit_canewl;
  REG32	reg_canewl;
} canewl_bits1,canewl_bits2,canewl_bits3,canewl_bits4;


/* CAN status register */
typedef union{
struct {
  REG32 RBS                :1;
  REG32 DOS                :1;
  REG32 TBS1               :1;
  REG32 TCS1               :1;
  REG32 RS                 :1;
  REG32 TS1                :1;
  REG32 ES                 :1;
  REG32 BS                 :1;
  REG32 /*RBS*/            :1;
  REG32 /*DOS*/            :1;
  REG32 TBS2               :1;
  REG32 TCS2               :1;
  REG32 /*RS*/             :1;
  REG32 TS2                :1;
  REG32 /*ES*/             :1;
  REG32 /*BS*/             :1;
  REG32 /*RBS*/            :1;
  REG32 /*DOS*/            :1;
  REG32 TBS3               :1;
  REG32 TCS3               :1;
  REG32 /*RS*/             :1;
  REG32 TS3                :1;
  REG32 /*ES*/             :1;
  REG32 /*BS*/             :1;
  REG32 /**/               :8; 
  }	bit_cansr;
  REG32	reg_cansr;
} cansr_bits1,cansr_bits2,cansr_bits3,cansr_bits4;


/* CAN rx frame status register */
typedef union{
struct {
  REG32 IDIndex            :10;
  REG32 BP                 :1;
  REG32 /**/               :5;
  REG32 DLC                :4;
  REG32 /**/               :10;
  REG32 RTR                :1;
  REG32 FF                 :1; 
  }	bit_canrfs;
  REG32	reg_canrfs;
} canrfs_bits1,canrfs_bits2,canrfs_bits3,canrfs_bits4;


/* CAN rx identifier register */
typedef union{
union {
  //CxRID
  struct {
   REG32 ID10_0             :11;
   REG32 /**/               :21;
  }ID10;
  //CxRID
  struct {
   REG32 ID29_18            :11;
   REG32 /**/               :21;
  }ID2918;
  //CxRID
  struct {
   REG32 ID29_0             :29;
   REG32 /**/               :3;
  }ID290;						
  }	bit_canrid;
  REG32	reg_canrid;
} canrid_bits1,canrid_bits2,canrid_bits3,canrid_bits4;


/* CAN rx data register A */
typedef union{
struct {
  REG32 Data1               :8;
  REG32 Data2               :8;
  REG32 Data3               :8;
  REG32 Data4               :8;	   
  }	bit_canrda;
  REG32	reg_canrda;
} canrda_bits1,canrda_bits2,canrda_bits3,canrda_bits4;


/* CAN rx data register B */
typedef union{
struct {
  REG32 Data5               :8;
  REG32 Data6               :8;
  REG32 Data7               :8;
  REG32 Data8               :8;	 
  }	bit_canrdb;
  REG32	reg_canrdb;
} canrdb_bits1,canrdb_bits2,canrdb_bits3,canrdb_bits4;


/* CAN tx frame information register */
typedef union{
struct {
  REG32 PRIO              :8;
  REG32 /**/              :8;
  REG32 DLC               :4;
  REG32 /**/              :10;
  REG32 RTR               :1;
  REG32 FF                :1; 
  }	bit_cantfi;
  REG32	reg_cantfi;
} cantfi_bits11,cantfi_bits12,cantfi_bits13,cantfi_bits21,cantfi_bits22,cantfi_bits23,cantfi_bits31,cantfi_bits32,cantfi_bits33,cantfi_bits41,cantfi_bits42,cantfi_bits43;


/* CAN tx identifier register */
typedef union{
union {
  //CxTIDy
  struct {
   REG32 ID10_0             :11;
   REG32 /**/               :21;
  }ID10;
  //CxTIDy
  struct {
   REG32 ID29_18            :11;
   REG32 /**/               :21;
  }ID2918;
  //CxTIDy
  struct {
   REG32 ID29_0             :29;
   REG32 /**/               :3;
  }ID290;					  
  }	bit_cantid;
  REG32	reg_cantid;
} cantid_bits11,cantid_bits12,cantid_bits13,cantid_bits21,cantid_bits22,cantid_bits23,cantid_bits31,cantid_bits32,cantid_bits33,cantid_bits41,cantid_bits42,cantid_bits43;


/* CAN tx data register A */
typedef union{
struct {
  REG32 Data1               :8;
  REG32 Data2               :8;
  REG32 Data3               :8;
  REG32 Data4               :8;	   
  }	bit_cantda;
  REG32	reg_cantda;
} cantda_bits11,cantda_bits12,cantda_bits13,cantda_bits21,cantda_bits22,cantda_bits23,cantda_bits31,cantda_bits32,cantda_bits33,cantda_bits41,cantda_bits42,cantda_bits43;


/* CAN tx data register B */
typedef union{
struct {
  REG32 Data5               :8;
  REG32 Data6               :8;
  REG32 Data7               :8;
  REG32 Data8               :8;	
  }	bit_cantdb;
  REG32	reg_cantdb;
} cantdb_bits11,cantdb_bits12,cantdb_bits13,cantdb_bits21,cantdb_bits22,cantdb_bits23,cantdb_bits31,cantdb_bits32,cantdb_bits33,cantdb_bits41,cantdb_bits42,cantdb_bits43;


/* TIMER interrupt register */
typedef union{
struct {
  REG32 MR0INT          :1;
  REG32 MR1INT          :1;
  REG32 MR2INT          :1;
  REG32 MR3INT          :1;
  REG32 CR0INT          :1;
  REG32 CR1INT          :1;
  REG32 CR2INT          :1;
  REG32 CR3INT          :1;
  REG32 /**/            :24;   
  }	bit_ir;
  REG32	reg_ir;
} ir_bits0,ir_bits1;

/* TIMER control register */
typedef union{
struct {
  REG32 CE              :1;
  REG32 CR              :1;
  REG32 /**/            :30; 
  }	bit_tcr;
  REG32	reg_tcr;
} tcr_bits0,tcr_bits1;

/* Count Control Register */
typedef union{
struct{
REG32 TIMER_MODE  : 2;     
REG32 INPUT_SEL   : 2;     
REG32 /**/        :28;     
  }	bit_ctcr;
  REG32	reg_ctcr;
} ctcr_bits0,ctcr_bits1;

/* TIMER match control register */
typedef union{
struct {
  REG32 MR0INT          :1;
  REG32 MR0RES          :1;
  REG32 MR0STOP         :1;
  REG32 MR1INT          :1;
  REG32 MR1RES          :1;
  REG32 MR1STOP         :1;
  REG32 MR2INT          :1;
  REG32 MR2RES          :1;
  REG32 MR2STOP         :1;
  REG32 MR3INT          :1;
  REG32 MR3RES          :1;
  REG32 MR3STOP         :1;
  REG32 /**/            :20;   
  }	bit_mcr;
  REG32	reg_mcr;
} mcr_bits0,mcr_bits1;

/* TIMER0 capture control register */
typedef union{
struct {
  REG32 CAP0RE          :1;
  REG32 CAP0FE          :1;
  REG32 CAP0INT         :1;
  REG32 CAP1RE          :1;
  REG32 CAP1FE          :1;
  REG32 CAP1INT         :1;
  REG32 CAP2RE          :1;
  REG32 CAP2FE          :1;
  REG32 CAP2INT         :1;
  REG32 /**/            :23;  
  }	bit_ccr0;
  REG32	reg_ccr0;
} ccr0_bits;

/* TIMER1 capture control register */
typedef union{
struct {
  REG32 CAP0RE          :1;
  REG32 CAP0FE          :1;
  REG32 CAP0INT         :1;
  REG32 CAP1RE          :1;
  REG32 CAP1FE          :1;
  REG32 CAP1INT         :1;
  REG32 CAP2RE          :1;
  REG32 CAP2FE          :1;
  REG32 CAP2INT         :1;
  REG32 CAP3RE          :1;
  REG32 CAP3FE          :1;
  REG32 CAP3INT         :1;
  REG32 /**/            :20;   
  }	bit_ccr1;
  REG32	reg_ccr1;
} ccr1_bits;

/* TIMER external match register */
typedef union{
struct {
  REG32 EM0             :1;
  REG32 EM1             :1;
  REG32 EM2             :1;
  REG32 EM3             :1;
  REG32 EMC0            :2;
  REG32 EMC1            :2;
  REG32 EMC2            :2;
  REG32 EMC3            :2;
  REG32 /**/            :20;   
  }	bit_emr;
  REG32	reg_emr;
} emr_bits0,emr_bits1;


