RuinaLab/Ranger/Robot_Nervous_System/LPC2xxx_Modules/mod_header/LPC2194_01.h
/* PWM interrupt register */
typedef union{
struct {
  REG32 MR0INT          :1;
  REG32 MR1INT          :1;
  REG32 MR2INT          :1;
  REG32 MR3INT          :1;
  REG32 /**/            :4;  
  REG32 MR4INT          :1;
  REG32 MR5INT          :1;
  REG32 MR6INT          :1;
  REG32 /**/            :21;  
  }	bit_pwmir;
  REG32	reg_pwmir;
} pwmir_bits;

/* PWM timer control register */
typedef union{
struct {
  REG32 CE              :1;
  REG32 CR              :1;
  REG32 /**/            :1;
  REG32 PWMEN           :1;
  REG32 /**/            :28;  
  }	bit_pwmtcr;
  REG32	reg_pwmtcr;
} pwmtcr_bits;

/* PWM match control register */
typedef union{
struct {
  REG32 MR0INT          :1;
  REG32 MR0RES          :1;
  REG32 MR0STOP         :1;
  REG32 MR1INT          :1;
  REG32 MR1RES          :1;
  REG32 MR1STOP         :1;
  REG32 MR2INT          :1;
  REG32 MR2RES          :1;
  REG32 MR2STOP         :1;
  REG32 MR3INT          :1;
  REG32 MR3RES          :1;
  REG32 MR3STOP         :1;
  REG32 MR4INT          :1;
  REG32 MR4RES          :1;
  REG32 MR4STOP         :1;
  REG32 MR5INT          :1;
  REG32 MR5RES          :1;
  REG32 MR5STOP         :1;
  REG32 MR6INT          :1;
  REG32 MR6RES          :1;
  REG32 MR6STOP         :1;
  REG32 /**/            :11;  
  }	bit_pwmmcr;
  REG32	reg_pwmmcr;
} pwmmcr_bits;


/* PWM  control register */
typedef union{
struct {
  REG32 /**/            :1;
  REG32 SEL1            :1;
  REG32 SEL2            :1;
  REG32 SEL3            :1;
  REG32 SEL4            :1;
  REG32 SEL5            :1;
  REG32 SEL6            :1;
  REG32 /**/            :2;
  REG32 ENA1            :1;
  REG32 ENA2            :1;
  REG32 ENA3            :1;
  REG32 ENA4            :1;
  REG32 ENA5            :1;
  REG32 ENA6            :1;
  REG32 /**/            :17;   
  }	bit_pwmpcr;
  REG32	reg_pwmpcr;
} pwmpcr_bits;

/* PWM latch enable register */
typedef union{
struct {
  REG32 EM0L            :1;
  REG32 EM1L            :1;
  REG32 EM2L            :1;
  REG32 EM3L            :1;
  REG32 EM4L            :1;
  REG32 EM5L            :1;
  REG32 EM6L            :1;
  REG32 /**/            :25;   
  }	bit_pwmler;
  REG32	reg_pwmler;
} pwmler_bits;



/* A/D control register */
typedef union{
struct {
  REG32 SEL             :8;
  REG32 CLKDIV          :8;
  REG32 BURST           :1;
  REG32 CLKS            :3;
  REG32 /**/            :1;
  REG32 PDN             :1;
  REG32 TEST            :2;
  REG32 START           :3;
  REG32 EDGE            :1;
  REG32 /**/            :4;	  
  }	bit_adcr;
  REG32	reg_adcr;
} adcr_bits;

/* A/D data register */
typedef union{
struct {
  REG32 /**/            :6;
  REG32 VVDDA           :10;
  REG32 /**/            :8;
  REG32 CHN             :3;
  REG32 /**/            :3;
  REG32 OVERUN          :1;
  REG32 DONE            :1;	 
  }	bit_addr;
  REG32	reg_addr;
} addr_bits;


/* A/D data register channel 0 */
typedef union{
	struct {
		REG32 /**/            :6;
		REG32 RESULT          :10;
		REG32 /**/            :14;
		REG32 OVERUN          :1;
		REG32 DONE            :1;	 
	}	bit_addr0;
	REG32	reg_addr0;
} addr0_bits;

/* A/D data register channel 1 */
typedef union{
	struct {
		REG32 /**/            :6;
		REG32 RESULT          :10;
		REG32 /**/            :14;
		REG32 OVERUN          :1;
		REG32 DONE            :1;	 
	}	bit_addr1;
	REG32	reg_addr1;
} addr1_bits;

/* A/D data register channel 2 */
typedef union{
	struct {
		REG32 /**/            :6;
		REG32 RESULT          :10;
		REG32 /**/            :14;
		REG32 OVERUN          :1;
		REG32 DONE            :1;	 
	}	bit_addr2;
	REG32	reg_addr2;
} addr2_bits;

/* A/D data register channel 3 */
typedef union{
	struct {
		REG32 /**/            :6;
		REG32 RESULT          :10;
		REG32 /**/            :14;
		REG32 OVERUN          :1;
		REG32 DONE            :1;	 
	}	bit_addr3;
	REG32	reg_addr3;
} addr3_bits;


/* RTC interrupt location register */
typedef union{
struct {
  REG32 RTCCIF          :1;
  REG32 RTCALF          :1;
  REG32 /**/            :30;  
  }	bit_ilr;
  REG32	reg_ilr;
} ilr_bits;

/* RTC clock tick counter register */
typedef union{
struct {
  REG32 /**/            :1;
  REG32 COUNTER         :15;
  REG32 /**/            :16;
  }	bit_ctc;
  REG32	reg_ctc;
} ctc_bits;

/* RTC clock control register */
typedef union{
struct {
  REG32 CLKEN           :1;
  REG32 CTCRST          :1;
  REG32 CTTEST          :2;
  REG32 /**/            :28;
  }	bit_rtcccr;
  REG32	reg_rtcccr;
} rtcccr_bits;

/* RTC counter increment interrupt register */
typedef union{
struct {
  REG32 IMSEC           :1;
  REG32 IMMIN           :1;
  REG32 IMHOUR          :1;
  REG32 IMDOM           :1;
  REG32 IMDOW           :1;
  REG32 IMDOY           :1;
  REG32 IMMON           :1;
  REG32 IMYEAR          :1;
  REG32 /**/            :24; 
  }	bit_ciir;
  REG32	reg_ciir;
} ciir_bits;

/* RTC alarm mask register */
typedef union{
struct {
  REG32 AMRSEC          :1;
  REG32 AMRMIN          :1;
  REG32 AMRHOUR         :1;
  REG32 AMRDOM          :1;
  REG32 AMRDOW          :1;
  REG32 AMRDOY          :1;
  REG32 AMRMON          :1;
  REG32 AMRYEAR         :1;
  REG32 /**/            :24; 
  }	bit_amr;
  REG32	reg_amr;
} amr_bits;

/* RTC consolidated time register 0 */
typedef union{
struct {
  REG32 SEC             :6;
  REG32 /**/            :2;
  REG32 MIN             :6;
  REG32 /**/            :2;
  REG32 HOUR            :5;
  REG32 /**/            :3;
  REG32 DOW             :3;
  REG32 /**/            :5;	
  }	bit_ctime0;
  REG32	reg_ctime0;
} ctime0_bits;

/* RTC consolidated time register 1 */
typedef union{
struct {
  REG32 DOM             :5;
  REG32 /**/            :3;
  REG32 MON             :4;
  REG32 /**/            :4;
  REG32 YEAR            :12;
  REG32 /**/            :4;	
  }	bit_ctime1;
  REG32	reg_ctime1;
} ctime1_bits;

/* RTC consolidated time register 2 */
typedef union{
struct {
  REG32 DOY             :12;
  REG32 /**/            :20; 
  }	bit_ctime2;
  REG32	reg_ctime2;
} ctime2_bits;

