RuinaLab/Ranger/Robot_Nervous_System/LPC2xxx_Modules/mod_header/LPC2194_01.h
/* RTC second register */
typedef union{
struct {
  REG32 SEC             :6;
  REG32 /**/            :26;  
  }	bit_sec;
  REG32	reg_sec;
} sec_bits1,sec_bits2;

/* RTC minute register */
typedef union{
struct {
  REG32 MIN             :6;
  REG32 /**/            :26;  
  }	bit_min;
  REG32	reg_min;
} min_bits1,min_bits2;

/* RTC hour register */
typedef union{
struct {
  REG32 HOUR            :5;
  REG32 /**/            :27; 
  }	bit_hour;
  REG32	reg_hour;
} hour_bits1,hour_bits2;

/* RTC day of month register */
typedef union{
struct {
  REG32 DOM             :5;
  REG32 /**/            :27; 
  }	bit_dom;
  REG32	reg_dom;
} dom_bits1,dom_bits2;

/* RTC day of week register */
typedef union{
struct {
  REG32 DOW             :3;
  REG32 /**/            :29; 
  }	bit_dow;
  REG32	reg_dow;
} dow_bits1,dow_bits2;

/* RTC day of year register */
typedef union{
struct {
  REG32 DOY             :9;
  REG32 /**/            :23; 
  } bit_doy;
  REG32	reg_doy;
} doy_bits1,doy_bits2;

/* RTC month register */
typedef union{
struct {
  REG32 MON             :4;
  REG32 /**/            :28; 
  }	bit_month;
  REG32	reg_month;
} month_bits1,month_bits2;

/* RTC year register */
typedef union{
struct {
  REG32 YEAR            :12;
  REG32 /**/            :20; 
  }	bit_year;
  REG32 reg_year;
} year_bits1,year_bits2;

/* RTC prescaler value, integer portion register */
typedef union{
struct {
  REG32 VALUE           :13;
  REG32 /**/            :19; 
  }	bit_preint;
  REG32	reg_preint;
} preint_bits;

/* RTC prescaler value, fractional portion register */
typedef union{
struct {
  REG32 VALUE           :15;
  REG32 /**/            :17; 
  }	bit_prefrac;
  REG32	reg_prefrac;
} prefrac_bits;

/* Watchdog mode register */
typedef union{
struct {
  REG32 WDEN            :1;
  REG32 WDRESET         :1;
  REG32 WDTOF           :1;
  REG32 WDINT           :1;
  REG32 /**/            :28;  
  }	bit_wdmod;
  REG32	reg_wdmod;
} wdmod_bits;

/* Watchdog feed register */
typedef union{
struct {
  REG32 FEED            :8;
  REG32 /**/            :24;  
  }	bit_wdfeed;
  REG32 reg_wdfeed;
} wdfeed_bits;

/* System Control and Status */
typedef union{
struct {
  REG32 GPIO0M          :1;
  REG32 GPIO1M          :1;  
  REG32 /**/            :30; 
  }	bit_scs;
  REG32	reg_scs;
} scs_bits;

/* Common declarations  ****************************************************/

/***************************************************************************
 **
 ** System control block
 **														   
 ***************************************************************************/
#define EXTINT_str (*((volatile extint_bits*)0xE01FC140))
#define EXTINT	       EXTINT_str.reg_extint
#define EXTINT_bit	   EXTINT_str.bit_extint
#define EXTWAKE_str (*((volatile extwake_bits*)0xE01FC144))
#define EXTWAKE	       EXTWAKE_str.reg_extwake
#define EXTWAKE_bit	   EXTWAKE_str.bit_extwake
#define EXTMODE_str (*((volatile extmode_bits*)0xE01FC148))
#define EXTMODE	       EXTMODE_str.reg_extmode
#define EXTMODE_bit	   EXTMODE_str.bit_extmode
#define EXTPOLAR_str (*((volatile extpolar_bits*)0xE01FC14C))
#define EXTPOLAR	   EXTPOLAR_str.reg_extpolar
#define EXTPOLAR_bit   EXTPOLAR_str.bit_extpolar
#define MEMMAP_str (*((volatile memmap_bits*)0xE01FC040))
#define MEMMAP	       MEMMAP_str.reg_memmap
#define MEMMAP_bit	   MEMMAP_str.bit_memmap
#define PLLCON_str (*((volatile pllcon_bits*)0xE01FC080))
#define PLLCON	       PLLCON_str.reg_pllcon
#define PLLCON_bit	   PLLCON_str.bit_pllcon
#define PLLCFG_str (*((volatile pllcfg_bits*)0xE01FC084))
#define PLLCFG	       PLLCFG_str.reg_pllcfg
#define PLLCFG_bit	   PLLCFG_str.bit_pllcfg
#define PLLSTAT_str (*((volatile pllstat_bits*)0xE01FC088))
#define PLLSTAT	       PLLSTAT_str.reg_pllstat
#define PLLSTAT_bit	   PLLSTAT_str.bit_pllstat
#define PLLFEED_str (*((volatile pllfeed_bits*)0xE01FC08C))
#define PLLFEED	       PLLFEED_str.reg_pllfeed
#define PLLFEED_bit	   PLLFEED_str.bit_pllfeed
#define PCON_str (*((volatile pcon_bits*)0xE01FC0C0))
#define PCON	       PCON_str.reg_pcon
#define PCON_bit	   PCON_str.bit_pcon
#define PCONP_str (*((volatile pconp_bits*)0xE01FC0C4))
#define PCONP	       PCONP_str.reg_pconp
#define PCONP_bit	   PCONP_str.bit_pconp	
#define VPBDIV_str (*((volatile vpbdiv_bits*)0xE01FC100))
#define VPBDIV	       VPBDIV_str.reg_vpbdiv
#define VPBDIV_bit	   VPBDIV_str.bit_vpbdiv
#define SCS_str (*((volatile scs_bits*)0xE01FC1A0))
#define SCS	           SCS_str.reg_scs
#define SCS_bit	       SCS_str.bit_scs

/***************************************************************************
 **
 ** MAM
 **
 ***************************************************************************/
#define MAMCR_str (*((volatile mamcr_bits*)0xE01FC000))
#define MAMCR	           MAMCR_str.reg_mamcr
#define MAMCR_bit	       MAMCR_str.bit_mamcr
#define MAMTIM_str (*((volatile mamtim_bits*)0xE01FC004))
#define MAMTIM	           SCS_str.reg_mamtim
#define MAMTIM_bit	       SCS_str.bit_mamtim

/***************************************************************************
 **
 ** VIC
 **
 ***************************************************************************/
#define VICIRQStatus_str (*((volatile vicint_bits1*)0xFFFFF000))
#define VICIRQStatus	           VICIRQStatus_str.reg_vicint
#define VICIRQStatus_bit	       VICIRQStatus_str.bit_vicint
#define VICFIQStatus_str (*((volatile vicint_bits2*)0xFFFFF004))
#define VICFIQStatus	           VICFIQStatus_str.reg_vicint
#define VICFIQStatus_bit	       VICFIQStatus_str.bit_vicint
#define VICRawIntr_str (*((volatile vicint_bits3*)0xFFFFF008))   
#define VICRawIntr	               VICRawIntr_str.reg_vicint
#define VICRawIntr_bit	           VICRawIntr_str.bit_vicint
#define VICIntSelect_str (*((volatile vicint_bits4*)0xFFFFF00C)) 
#define VICIntSelect	           VICIntSelect_str.reg_vicint
#define VICIntSelect_bit	       VICIntSelect_str.bit_vicint
#define VICIntEnable_str (*((volatile vicint_bits5*)0xFFFFF010)) 
#define VICIntEnable	           VICIntEnable_str.reg_vicint
#define VICIntEnable_bit	       VICIntEnable_str.bit_vicint
#define VICIntEnClear_str (*((volatile vicint_bits6*)0xFFFFF014))	
#define VICIntEnClear	           VICIntEnClear_str.reg_vicint
#define VICIntEnClear_bit	       VICIntEnClear_str.bit_vicint
#define VICSoftInt_str (*((volatile vicint_bits7*)0xFFFFF018))   
#define VICSoftInt	               VICSoftInt_str.reg_vicint
#define VICSoftInt_bit	           VICSoftInt_str.bit_vicint
#define VICSoftIntClear_str (*((volatile vicint_bits8*)0xFFFFF01C)) 
#define VICSoftIntClear	           VICSoftIntClear_str.reg_vicint
#define VICSoftIntClear_bit	           VICSoftIntClear_str.bit_vicint
#define VICProtection_str (*((volatile vicprotection_bits*)0xFFFFF020)) 
#define VICProtection	           VICProtection_str.reg_vicprotection
#define VICProtection_bit	       VICProtection_str.bit_vicprotection
#define VICVectAddr (*((REG32 *)0xFFFFF030))	 
#define VICDefVectAddr (*((REG32 *)0xFFFFF034))
#define VICVectAddr0 (*((REG32 *)0xFFFFF100))	 
#define VICVectAddr1 (*((REG32 *)0xFFFFF104))	 
#define VICVectAddr2 (*((REG32 *)0xFFFFF108))	
#define VICVectAddr3 (*((REG32 *)0xFFFFF10C))	
#define VICVectAddr4 (*((REG32 *)0xFFFFF110))	
#define VICVectAddr5 (*((REG32 *)0xFFFFF114))	
#define VICVectAddr6 (*((REG32 *)0xFFFFF118))	
#define VICVectAddr7 (*((REG32 *)0xFFFFF11C))	
#define VICVectAddr8 (*((REG32 *)0xFFFFF120))	
#define VICVectAddr9 (*((REG32 *)0xFFFFF124))	 
#define VICVectAddr10 (*((REG32 *)0xFFFFF128)) 
#define VICVectAddr11 (*((REG32 *)0xFFFFF12C)) 
#define VICVectAddr12 (*((REG32 *)0xFFFFF130))
#define VICVectAddr13 (*((REG32 *)0xFFFFF134)) 
#define VICVectAddr14 (*((REG32 *)0xFFFFF138)) 
#define VICVectAddr15 (*((REG32 *)0xFFFFF13C))
#define VICVectCntl0_str (*((volatile vicvectcntl_bits0*)0xFFFFF200))
#define VICVectCntl0	           VICVectCntl0_str.reg_vicvectcntl
#define VICVectCntl0_bit	       VICVectCntl0_str.bit_vicvectcntl
#define VICVectCntl1_str (*((volatile vicvectcntl_bits1*)0xFFFFF204))	
#define VICVectCntl1	           VICVectCntl1_str.reg_vicvectcntl
#define VICVectCntl1_bit	       VICVectCntl1_str.bit_vicvectcntl
#define VICVectCntl2_str (*((volatile vicvectcntl_bits2*)0xFFFFF208))	
#define VICVectCntl2	           VICVectCntl2_str.reg_vicvectcntl
#define VICVectCntl2_bit	       VICVectCntl2_str.bit_vicvectcntl
#define VICVectCntl3_str (*((volatile vicvectcntl_bits3*)0xFFFFF20C))
#define VICVectCntl3	           VICVectCntl3_str.reg_vicvectcntl
#define VICVectCntl3_bit	       VICVectCntl3_str.bit_vicvectcntl
#define VICVectCntl4_str (*((volatile vicvectcntl_bits4*)0xFFFFF210))
#define VICVectCntl4	           VICVectCntl4_str.reg_vicvectcntl
#define VICVectCntl4_bit	       VICVectCntl4_str.bit_vicvectcntl
#define VICVectCntl5_str (*((volatile vicvectcntl_bits5*)0xFFFFF214))
#define VICVectCntl5	           VICVectCntl5_str.reg_vicvectcntl
#define VICVectCntl5_bit	       VICVectCntl5_str.bit_vicvectcntl
#define VICVectCntl6_str (*((volatile vicvectcntl_bits6*)0xFFFFF218))
#define VICVectCntl6	           VICVectCntl6_str.reg_vicvectcntl
#define VICVectCntl6_bit	       VICVectCntl6_str.bit_vicvectcntl
#define VICVectCntl7_str (*((volatile vicvectcntl_bits7*)0xFFFFF21C))
#define VICVectCntl7	           VICVectCntl7_str.reg_vicvectcntl
#define VICVectCntl7_bit	       VICVectCntl7_str.bit_vicvectcntl
#define VICVectCntl8_str (*((volatile vicvectcntl_bits8*)0xFFFFF220))	
#define VICVectCntl8	           VICVectCntl8_str.reg_vicvectcntl
#define VICVectCntl8_bit	       VICVectCntl8_str.bit_vicvectcntl
#define VICVectCntl9_str (*((volatile vicvectcntl_bits9*)0xFFFFF224))	
#define VICVectCntl9	           VICVectCntl9_str.reg_vicvectcntl
#define VICVectCntl9_bit	       VICVectCntl9_str.bit_vicvectcntl
#define VICVectCntl10_str (*((volatile vicvectcntl_bits10*)0xFFFFF228))
#define VICVectCntl10	           VICVectCntl10_str.reg_vicvectcntl
#define VICVectCntl10_bit	       VICVectCntl10_str.bit_vicvectcntl
#define VICVectCntl11_str (*((volatile vicvectcntl_bits11*)0xFFFFF22C))
#define VICVectCntl11	           VICVectCntl11_str.reg_vicvectcntl
#define VICVectCntl11_bit	       VICVectCntl11_str.bit_vicvectcntl
#define VICVectCntl12_str (*((volatile vicvectcntl_bits12*)0xFFFFF230))
#define VICVectCntl12	           VICVectCntl12_str.reg_vicvectcntl
#define VICVectCntl12_bit	       VICVectCntl12_str.bit_vicvectcntl
#define VICVectCntl13_str (*((volatile vicvectcntl_bits13*)0xFFFFF234))
#define VICVectCntl13	           VICVectCntl13_str.reg_vicvectcntl
#define VICVectCntl13_bit	       VICVectCntl13_str.bit_vicvectcntl
#define VICVectCntl14_str (*((volatile vicvectcntl_bits14*)0xFFFFF238)) 
#define VICVectCntl14	           VICVectCntl14_str.reg_vicvectcntl
#define VICVectCntl14_bit	       VICVectCntl14_str.bit_vicvectcntl
#define VICVectCntl15_str (*((volatile vicvectcntl_bits15*)0xFFFFF23C))
#define VICVectCntl15	           VICVectCntl15_str.reg_vicvectcntl
#define VICVectCntl15_bit	       VICVectCntl15_str.bit_vicvectcntl

/***************************************************************************
 **
 ** Pin connect block
 **
 ***************************************************************************/
#define PINSEL0_str (*((volatile pinsel0_bits*)0xE002C000))
#define PINSEL0	           PINSEL0_str.reg_pinsel0
#define PINSEL0_bit	       PINSEL0_str.bit_pinsel0
#define PINSEL1_str (*((volatile pinsel1_bits*)0xE002C004))
#define PINSEL1	           PINSEL1_str.reg_pinsel1
#define PINSEL1_bit	       PINSEL1_str.bit_pinsel1
#define PINSEL2 (*((REG32 *)0xE002C014))

/***************************************************************************
 **
 ** GPIO
 **
 ***************************************************************************/
#define IO0PIN_str (*((volatile gpio0_bits1*)0xE0028000))
#define IO0PIN	           IO0PIN_str.reg_gpio0
#define IO0PIN_bit	       IO0PIN_str.bit_gpio0
#define IO0SET_str (*((volatile gpio0_bits2*)0xE0028004))	  
#define IO0SET	           IO0SET_str.reg_gpio0
#define IO0SET_bit	       IO0SET_str.bit_gpio0
#define IO0DIR_str (*((volatile gpio0_bits3*)0xE0028008))
#define IO0DIR	           IO0DIR_str.reg_gpio0
#define IO0DIR_bit	       IO0DIR_str.bit_gpio0
#define IO0CLR_str (*((volatile gpio0_bits4*)0xE002800C))
#define IO0CLR	           IO0CLR_str.reg_gpio0
#define IO0CLR_bit	       IO0CLR_str.bit_gpio0
#define FIO0DIR_str (*((volatile fgpio0_bits1*)0x3FFFC000))
#define FIO0DIR			  FIO0DIR_str.reg_fgpio0
#define FIO0DIR_bit		  FIO0DIR_str.bit_fgpio0.addr0_w
#define FIO0DIR0          FIO0DIR_str.bit_fgpio0.addr0_b.byte_0.byte0
#define FIO0DIR0_bit      FIO0DIR_str.bit_fgpio0.addr0_b.byte_0.byte0_bit
#define FIO0DIR1          FIO0DIR_str.bit_fgpio0.addr0_b.byte_1.byte1
#define FIO0DIR1_bit      FIO0DIR_str.bit_fgpio0.addr0_b.byte_1.byte1_bit
#define FIO0DIR2          FIO0DIR_str.bit_fgpio0.addr0_b.byte_2.byte2
#define FIO0DIR2_bit      FIO0DIR_str.bit_fgpio0.addr0_b.byte_2.byte2_bit
#define FIO0DIR3          FIO0DIR_str.bit_fgpio0.addr0_b.byte_3.byte3
#define FIO0DIR3_bit      FIO0DIR_str.bit_fgpio0.addr0_b.byte_3.byte3_bit
#define FIO0DIRL          FIO0DIR_str.bit_fgpio0.addr0_hw.hw0.shortl
#define FIO0DIRL_bit      FIO0DIR_str.bit_fgpio0.addr0_hw.hw0.shortl_bit
#define FIO0DIRU          FIO0DIR_str.bit_fgpio0.addr0_hw.hw1.shortu
#define FIO0DIRU_bit      FIO0DIR_str.bit_fgpio0.addr0_hw.hw1.shortu_bit
#define FIO0MASK_str (*((volatile fgpio0_bits2*)0x3FFFC010))
#define FIO0MASK		  FIO0MASK_str.reg_fgpio0
#define FIO0MASK_bit	  FIO0MASK_str.bit_fgpio0.addr0_w
#define FIO0MASK0         FIO0MASK_str.bit_fgpio0.addr0_b.byte_0.byte0
#define FIO0MASK0_bit     FIO0MASK_str.bit_fgpio0.addr0_b.byte_0.byte0_bit
#define FIO0MASK1         FIO0MASK_str.bit_fgpio0.addr0_b.byte_1.byte1
#define FIO0MASK1_bit     FIO0MASK_str.bit_fgpio0.addr0_b.byte_1.byte1_bit
#define FIO0MASK2         FIO0MASK_str.bit_fgpio0.addr0_b.byte_2.byte2
#define FIO0MASK2_bit     FIO0MASK_str.bit_fgpio0.addr0_b.byte_2.byte2_bit
#define FIO0MASK3         FIO0MASK_str.bit_fgpio0.addr0_b.byte_3.byte3
#define FIO0MASK3_bit     FIO0MASK_str.bit_fgpio0.addr0_b.byte_3.byte3_bit
#define FIO0MASKL         FIO0MASK_str.bit_fgpio0.addr0_hw.hw0.shortl
#define FIO0MASKL_bit     FIO0MASK_str.bit_fgpio0.addr0_hw.hw0.shortl_bit
#define FIO0MASKU         FIO0MASK_str.bit_fgpio0.addr0_hw.hw1.shortu
#define FIO0MASKU_bit     FIO0MASK_str.bit_fgpio0.addr0_hw.hw1.shortu_bit
#define FIO0PIN_str (*((volatile fgpio0_bits3*)0x3FFFC014))
#define FIO0PIN		      FIO0PIN_str.reg_fgpio0
#define FIO0PIN_bit	      FIO0PIN_str.bit_fgpio0.addr0_w
#define FIO0PIN0          FIO0PIN_str.bit_fgpio0.addr0_b.byte_0.byte0
#define FIO0PIN0_bit      FIO0PIN_str.bit_fgpio0.addr0_b.byte_0.byte0_bit
#define FIO0PIN1          FIO0PIN_str.bit_fgpio0.addr0_b.byte_1.byte1
#define FIO0PIN1_bit      FIO0PIN_str.bit_fgpio0.addr0_b.byte_1.byte1_bit
#define FIO0PIN2          FIO0PIN_str.bit_fgpio0.addr0_b.byte_2.byte2
#define FIO0PIN2_bit      FIO0PIN_str.bit_fgpio0.addr0_b.byte_2.byte2_bit
#define FIO0PIN3          FIO0PIN_str.bit_fgpio0.addr0_b.byte_3.byte3
#define FIO0PIN3_bit      FIO0PIN_str.bit_fgpio0.addr0_b.byte_3.byte3_bit
#define FIO0PINL          FIO0PIN_str.bit_fgpio0.addr0_hw.hw0.shortl
#define FIO0PINL_bit      FIO0PIN_str.bit_fgpio0.addr0_hw.hw0.shortl_bit
#define FIO0PINU          FIO0PIN_str.bit_fgpio0.addr0_hw.hw1.shortu
#define FIO0PINU_bit      FIO0PIN_str.bit_fgpio0.addr0_hw.hw1.shortu_bit
#define FIO0SET_str (*((volatile fgpio0_bits4*)0x3FFFC018))
#define FIO0SET		      FIO0SET_str.reg_fgpio0
#define FIO0SET_bit	      FIO0SET_str.bit_fgpio0.addr0_w
#define FIO0SET0          FIO0SET_str.bit_fgpio0.addr0_b.byte_0.byte0
#define FIO0SET0_bit      FIO0SET_str.bit_fgpio0.addr0_b.byte_0.byte0_bit
#define FIO0SET1          FIO0SET_str.bit_fgpio0.addr0_b.byte_1.byte1
#define FIO0SET1_bit      FIO0SET_str.bit_fgpio0.addr0_b.byte_1.byte1_bit
#define FIO0SET2          FIO0SET_str.bit_fgpio0.addr0_b.byte_2.byte2
#define FIO0SET2_bit      FIO0SET_str.bit_fgpio0.addr0_b.byte_2.byte2_bit
#define FIO0SET3          FIO0SET_str.bit_fgpio0.addr0_b.byte_3.byte3
#define FIO0SET3_bit      FIO0SET_str.bit_fgpio0.addr0_b.byte_3.byte3_bit
#define FIO0SETL          FIO0SET_str.bit_fgpio0.addr0_hw.hw0.shortl
#define FIO0SETL_bit      FIO0SET_str.bit_fgpio0.addr0_hw.hw0.shortl_bit
#define FIO0SETU          FIO0SET_str.bit_fgpio0.addr0_hw.hw1.shortu
#define FIO0SETU_bit      FIO0SET_str.bit_fgpio0.addr0_hw.hw1.shortu_bit
#define FIO0CLR_str (*((volatile fgpio0_bits5*)0x3FFFC01C))
#define FIO0CLR		      FIO0CLR_str.reg_fgpio0
#define FIO0CLR_bit	      FIO0CLR_str.bit_fgpio0.addr0_w
#define FIO0CLR0          FIO0CLR_str.bit_fgpio0.addr0_b.byte_0.byte0
#define FIO0CLR0_bit      FIO0CLR_str.bit_fgpio0.addr0_b.byte_0.byte0_bit
#define FIO0CLR1          FIO0CLR_str.bit_fgpio0.addr0_b.byte_1.byte1
#define FIO0CLR1_bit      FIO0CLR_str.bit_fgpio0.addr0_b.byte_1.byte1_bit
#define FIO0CLR2          FIO0CLR_str.bit_fgpio0.addr0_b.byte_2.byte2
#define FIO0CLR2_bit      FIO0CLR_str.bit_fgpio0.addr0_b.byte_2.byte2_bit
#define FIO0CLR3          FIO0CLR_str.bit_fgpio0.addr0_b.byte_3.byte3
#define FIO0CLR3_bit      FIO0CLR_str.bit_fgpio0.addr0_b.byte_3.byte3_bit
#define FIO0CLRL          FIO0CLR_str.bit_fgpio0.addr0_hw.hw0.shortl
#define FIO0CLRL_bit      FIO0CLR_str.bit_fgpio0.addr0_hw.hw0.shortl_bit
#define FIO0CLRU          FIO0CLR_str.bit_fgpio0.addr0_hw.hw1.shortu
#define FIO0CLRU_bit      FIO0CLR_str.bit_fgpio0.addr0_hw.hw1.shortu_bit
#define IO1PIN_str (*((volatile gpio1_bits1*)0xE0028010))
#define IO1PIN	           IO1PIN_str.reg_gpio1
#define IO1PIN_bit	       IO1PIN_str.bit_gpio1
#define IO1SET_str (*((volatile gpio1_bits2*)0xE0028014))
#define IO1SET	           IO1SET_str.reg_gpio1
#define IO1SET_bit	       IO1SET_str.bit_gpio1
#define IO1DIR_str (*((volatile gpio1_bits3*)0xE0028018))
#define IO1DIR	           IO1DIR_str.reg_gpio1
#define IO1DIR_bit	       IO1DIR_str.bit_gpio1
#define IO1CLR_str (*((volatile gpio1_bits4*)0xE002801C))
#define IO1CLR	           IO1CLR_str.reg_gpio1
#define IO1CLR_bit	       IO1CLR_str.bit_gpio1
#define FIO1DIR_str (*((volatile fgpio1_bits1*)0x3FFFC020))
#define FIO1DIR		      FIO1DIR_str.reg_fgpio1
#define FIO1DIR_bit	      FIO1DIR_str.bit_fgpio1.addr1_w
#define FIO1DIR0          FIO1DIR_str.bit_fgpio1.addr1_b.byte_0.byte0
#define FIO1DIR0_bit      FIO1DIR_str.bit_fgpio1.addr1_b.byte_0.byte0_bit
#define FIO1DIR1          FIO1DIR_str.bit_fgpio1.addr1_b.byte_1.byte1
#define FIO1DIR1_bit      FIO1DIR_str.bit_fgpio1.addr1_b.byte_1.byte1_bit
#define FIO1DIR2          FIO1DIR_str.bit_fgpio1.addr1_b.byte_2.byte2
#define FIO1DIR2_bit      FIO1DIR_str.bit_fgpio1.addr1_b.byte_2.byte2_bit
#define FIO1DIR3          FIO1DIR_str.bit_fgpio1.addr1_b.byte_3.byte3
#define FIO1DIR3_bit      FIO1DIR_str.bit_fgpio1.addr1_b.byte_3.byte3_bit
#define FIO1DIRL          FIO1DIR_str.bit_fgpio1.addr1_hw.hw0.shortl
#define FIO1DIRL_bit      FIO1DIR_str.bit_fgpio1.addr1_hw.hw0.shortl_bit
#define FIO1DIRU          FIO1DIR_str.bit_fgpio1.addr1_hw.hw1.shortu
#define FIO1DIRU_bit      FIO1DIR_str.bit_fgpio1.addr1_hw.hw1.shortu_bit
#define FIO1MASK_str (*((volatile fgpio1_bits2*)0x3FFFC030))
#define FIO1MASK		  FIO1MASK_str.reg_fgpio1
#define FIO1MASK_bit	  FIO1MASK_str.bit_fgpio1.addr1_w
#define FIO1MASK0         FIO1MASK_str.bit_fgpio1.addr1_b.byte_0.byte0
#define FIO1MASK0_bit     FIO1MASK_str.bit_fgpio1.addr1_b.byte_0.byte0_bit
#define FIO1MASK1         FIO1MASK_str.bit_fgpio1.addr1_b.byte_1.byte1
#define FIO1MASK1_bit     FIO1MASK_str.bit_fgpio1.addr1_b.byte_1.byte1_bit
#define FIO1MASK2         FIO1MASK_str.bit_fgpio1.addr1_b.byte_2.byte2
#define FIO1MASK2_bit     FIO1MASK_str.bit_fgpio1.addr1_b.byte_2.byte2_bit
#define FIO1MASK3         FIO1MASK_str.bit_fgpio1.addr1_b.byte_3.byte3
#define FIO1MASK3_bit     FIO1MASK_str.bit_fgpio1.addr1_b.byte_3.byte3_bit
#define FIO1MASKL         FIO1MASK_str.bit_fgpio1.addr1_hw.hw0.shortl
#define FIO1MASKL_bit     FIO1MASK_str.bit_fgpio1.addr1_hw.hw0.shortl_bit
#define FIO1MASKU         FIO1MASK_str.bit_fgpio1.addr1_hw.hw1.shortu
#define FIO1MASKU_bit     FIO1MASK_str.bit_fgpio1.addr1_hw.hw1.shortu_bit
#define FIO1PIN_str (*((volatile fgpio1_bits3*)0x3FFFC034))
#define FIO1PIN		      FIO1PIN_str.reg_fgpio1
#define FIO1PIN_bit	      FIO1PIN_str.bit_fgpio1.addr1_w
#define FIO1PIN0          FIO1PIN_str.bit_fgpio1.addr1_b.byte_0.byte0
#define FIO1PIN0_bit      FIO1PIN_str.bit_fgpio1.addr1_b.byte_0.byte0_bit
#define FIO1PIN1          FIO1PIN_str.bit_fgpio1.addr1_b.byte_1.byte1
#define FIO1PIN1_bit      FIO1PIN_str.bit_fgpio1.addr1_b.byte_1.byte1_bit
#define FIO1PIN2          FIO1PIN_str.bit_fgpio1.addr1_b.byte_2.byte2
#define FIO1PIN2_bit      FIO1PIN_str.bit_fgpio1.addr1_b.byte_2.byte2_bit
#define FIO1PIN3          FIO1PIN_str.bit_fgpio1.addr1_b.byte_3.byte3
#define FIO1PIN3_bit      FIO1PIN_str.bit_fgpio1.addr1_b.byte_3.byte3_bit
#define FIO1PINL          FIO1PIN_str.bit_fgpio1.addr1_hw.hw0.shortl
#define FIO1PINL_bit      FIO1PIN_str.bit_fgpio1.addr1_hw.hw0.shortl_bit
#define FIO1PINU          FIO1PIN_str.bit_fgpio1.addr1_hw.hw1.shortu
#define FIO1PINU_bit      FIO1PIN_str.bit_fgpio1.addr1_hw.hw1.shortu_bit
#define FIO1SET_str (*((volatile fgpio1_bits4*)0x3FFFC038))
#define FIO1SET		      FIO1SET_str.reg_fgpio1
#define FIO1SET_bit	      FIO1SET_str.bit_fgpio1.addr1_w
#define FIO1SET0          FIO1SET_str.bit_fgpio1.addr1_b.byte_0.byte0
#define FIO1SET0_bit      FIO1SET_str.bit_fgpio1.addr1_b.byte_0.byte0_bit
#define FIO1SET1          FIO1SET_str.bit_fgpio1.addr1_b.byte_1.byte1
#define FIO1SET1_bit      FIO1SET_str.bit_fgpio1.addr1_b.byte_1.byte1_bit
#define FIO1SET2          FIO1SET_str.bit_fgpio1.addr1_b.byte_2.byte2
#define FIO1SET2_bit      FIO1SET_str.bit_fgpio1.addr1_b.byte_2.byte2_bit
#define FIO1SET3          FIO1SET_str.bit_fgpio1.addr1_b.byte_3.byte3
#define FIO1SET3_bit      FIO1SET_str.bit_fgpio1.addr1_b.byte_3.byte3_bit
#define FIO1SETL          FIO1SET_str.bit_fgpio1.addr1_hw.hw0.shortl
#define FIO1SETL_bit      FIO1SET_str.bit_fgpio1.addr1_hw.hw0.shortl_bit
#define FIO1SETU          FIO1SET_str.bit_fgpio1.addr1_hw.hw1.shortu
#define FIO1SETU_bit      FIO1SET_str.bit_fgpio1.addr1_hw.hw1.shortu_bit
#define FIO1CLR_str (*((volatile fgpio1_bits5*)0x3FFFC03C))
#define FIO1CLR		      FIO1CLR_str.reg_fgpio1
#define FIO1CLR_bit	      FIO1CLR_str.bit_fgpio1.addr1_w
#define FIO1CLR0          FIO1CLR_str.bit_fgpio1.addr1_b.byte_0.byte0
#define FIO1CLR0_bit      FIO1CLR_str.bit_fgpio1.addr1_b.byte_0.byte0_bit
#define FIO1CLR1          FIO1CLR_str.bit_fgpio1.addr1_b.byte_1.byte1
#define FIO1CLR1_bit      FIO1CLR_str.bit_fgpio1.addr1_b.byte_1.byte1_bit
#define FIO1CLR2          FIO1CLR_str.bit_fgpio1.addr1_b.byte_2.byte2
#define FIO1CLR2_bit      FIO1CLR_str.bit_fgpio1.addr1_b.byte_2.byte2_bit
#define FIO1CLR3          FIO1CLR_str.bit_fgpio1.addr1_b.byte_3.byte3
#define FIO1CLR3_bit      FIO1CLR_str.bit_fgpio1.addr1_b.byte_3.byte3_bit
#define FIO1CLRL          FIO1CLR_str.bit_fgpio1.addr1_hw.hw0.shortl
#define FIO1CLRL_bit      FIO1CLR_str.bit_fgpio1.addr1_hw.hw0.shortl_bit
#define FIO1CLRU          FIO1CLR_str.bit_fgpio1.addr1_hw.hw1.shortu
#define FIO1CLRU_bit      FIO1CLR_str.bit_fgpio1.addr1_hw.hw1.shortu_bit


/***************************************************************************
 **
 **  UART0
 **
 ***************************************************************************/

/* U0DLL, U0RBR and U0THR share the same address */
#define U0RBRTHR (*((REG8 *)0xE000C000))
#define U0DLL U0RBRTHR
#define U0RBR U0RBRTHR
#define U0THR U0RBRTHR

/* U0DLM and U0IER share the same address */
#define U0IER_str (*((volatile uartier0_bits*)0xE000C004))
#define U0IER		U0IER_str.reg_uartier0
#define U0IER_bit	U0IER_str.bit_uartier0
#define U0DLM       U0IER
#define U0DLM_bit	U0IER_bit

/* U0FCR and U0IIR share the same address */
#define U0FCR_IIR_str (*((volatile uartfcriir_bits0*)0xE000C008))
#define U0FCR       U0FCR_IIR_str.reg_uartfcriir
#define U0IIR_bit   U0FCR_IIR_str.bit_uartfcriir.iir
#define U0FCR_bit   U0FCR_IIR_str.bit_uartfcriir.fcr
#define U0IIR       U0FCR

