RuinaLab/Ranger/Robot_Nervous_System/LPC2xxx_Modules/mod_header/LPC2194_01.h
#define U0LCR_str (*((volatile uartlcr_bits0*)0xE000C00C))
#define U0LCR		U0LCR_str.reg_uartlcr
#define U0LCR_bit	U0LCR_str.bit_uartlcr
#define U0LSR_str (*((volatile uartlsr_bits0*)0xE000C014))
#define U0LSR		U0LSR_str.reg_uartlsr
#define U0LSR_bit	U0LSR_str.bit_uartlsr
#define U0SCR (*((REG8 *)0xE000C01C))
#define U0ACR_str (*((volatile uartacr_bits0*)0xE000C020))
#define U0ACR		U0ACR_str.reg_uartacr
#define U0ACR_bit	U0ACR_str.bit_uartacr
#define U0FDR_str (*((volatile uartfdr_bits0*)0xE000C028))
#define U0FDR		U0FDR_str.reg_uartfdr
#define U0FDR_bit	U0FDR_str.bit_uartfdr
#define U0TER_str (*((volatile uartter_bits0*)0xE000C030))
#define U0TER		U0TER_str.reg_uartter
#define U0TER_bit	U0TER_str.bit_uartter


/***************************************************************************
 **
 **  UART1
 **
 ***************************************************************************/

/* U1DLL, U1RBR and U1THR share the same address */
#define U1RBRTHR (*((REG8 *)0xE0010000))
#define U1DLL U1RBRTHR
#define U1RBR U1RBRTHR
#define U1THR U1RBRTHR

/* U1DLM and U1IER share the same address */
#define U1IER_str (*((volatile uartier1_bits*)0xE0010004))
#define U1IER		U1IER_str.reg_uartier1
#define U1IER_bit	U1IER_str.bit_uartier1
#define U1DLM       U1IER
#define U1DLM_bit	U1IER_bit

/* U1FCR and U1IIR share the same address */
#define U1FCR_IIR_str (*((volatile uartfcriir_bits1*)0xE0010008))
#define U1FCR       U1FCR_IIR_str.reg_uartfcriir
#define U1IIR_bit   U1FCR_IIR_str.bit_uartfcriir.iir
#define U1FCR_bit   U1FCR_IIR_str.bit_uartfcriir.fcr
#define U1IIR       U1FCR

#define U1MCR_str (*((volatile uartmcr_bits*)0xE0010010))
#define U1MCR		U1MCR_str.reg_uartmcr
#define U1MCR_bit	U1MCR_str.bit_uartmcr
#define U1LCR_str (*((volatile uartlcr_bits1*)0xE001000C))
#define U1LCR		U1LCR_str.reg_uartlcr
#define U1LCR_bit	U1LCR_str.bit_uartlcr
#define U1LSR_str (*((volatile uartlsr_bits1*)0xE0010014))
#define U1LSR		U1LSR_str.reg_uartlsr
#define U1LSR_bit	U1LSR_str.bit_uartlsr
#define U1MSR_str (*((volatile uartmsr_bits*)0xE0010018))
#define U1SCR (*((REG8 *)0xE001001C))
#define U1ACR_str (*((volatile uartacr_bits1*)0xE0010020))
#define U1ACR		U1ACR_str.reg_uartacr
#define U1ACR_bit	U1ACR_str.bit_uartacr
#define U1FDR_str (*((volatile uartfdr_bits1*)0xE0010028))
#define U1FDR		U1FDR_str.reg_uartfdr
#define U1FDR_bit	U1FDR_str.bit_uartfdr
#define U1TER_str (*((volatile uartter_bits1*)0xE0010030))
#define U1TER		U1TER_str.reg_uartter
#define U1TER_bit	U1TER_str.bit_uartter


/***************************************************************************
 **
 ** I2C
 **
 ***************************************************************************/
#define I2CONSET_str (*((volatile i2conset_bits*)0xE001C000))
#define I2CONSET		I2CONSET_str.reg_i2conset
#define I2CONSET_bit	I2CONSET_str.bit_i2conset
#define I2STAT_str (*((volatile i2stat_bits*)0xE001C004))
#define I2STAT	    	I2STAT_str.reg_i2stat
#define I2STAT_bit    	I2STAT_str.bit_i2stat
#define I2DAT_str (*((volatile i2dat_bits*)0xE001C008))
#define I2DAT	    	I2DAT_str.reg_i2dat
#define I2DAT_bit   	I2DAT_str.bit_i2dat
#define I2ADR_str (*((volatile i2adr_bits*)0xE001C00C))
#define I2ADR	    	I2ADR_str.reg_i2adr
#define I2ADR_bit   	I2ADR_str.bit_i2adr
#define I2SCLH_str (*((volatile i2scl_bits1*)0xE001C010))
#define I2SCLH	    	I2SCLH_str.reg_i2scl
#define I2SCLH_bit   	I2SCLH_str.bit_i2scl
#define I2SCLL_str (*((volatile i2scl_bits2*)0xE001C014))
#define I2SCLL	    	I2SCLL_str.reg_i2scl
#define I2SCLL_bit	    I2SCLL_str.bit_i2scl
#define I2CONCLR_str (*((volatile i2conclr_bits*)0xE001C018))
#define I2CONCLR		I2CONCLR_str.reg_i2conclr
#define I2CONCLR_bit	I2CONCLR_str.bit_i2conclr


/***************************************************************************
 **
 ** SPI
 **
 ***************************************************************************/
#define S0SPCR_str (*((volatile spcr_bits0*)0xE0020000))
#define S0SPCR		S0SPCR_str.reg_spcr
#define S0SPCR_bit	S0SPCR_str.bit_spcr
#define S0SPSR_str (*((volatile spsr_bits0*)0xE0020004))
#define S0SPSR		S0SPSR_str.reg_spsr
#define S0SPSR_bit	S0SPSR_str.bit_spsr
#define S0SPDR_str (*((volatile spdr_bits0*)0xE0020008))
#define S0SPDR		S0SPDR_str.reg_spdr
#define S0SPDR_bit	S0SPDR_str.bit_spdr
#define S0SPCCR_str (*((volatile spccr_bits0*)0xE002000C))
#define S0SPCCR		S0SPCCR_str.reg_spccr
#define S0SPCCR_bit	S0SPCCR_str.bit_spccr
#define S0SPINT_str (*((volatile spint_bits0*)0xE002001C))
#define S0SPINT		S0SPINT_str.reg_spint
#define S0SPINT_bit	S0SPINT_str.bit_spint
#define S1SPCR_str (*((volatile spcr_bits1*)0xE0030000)) 
#define S1SPCR		S1SPCR_str.reg_spcr
#define S1SPCR_bit	S1SPCR_str.bit_spcr
#define S1SPSR_str (*((volatile spsr_bits1*)0xE0030004))	
#define S1SPSR		S1SPSR_str.reg_spsr
#define S1SPSR_bit	S1SPSR_str.bit_spsr
#define S1SPDR_str (*((volatile spdr_bits1*)0xE0030008)) 
#define S1SPDR		S1SPDR_str.reg_spdr
#define S1SPDR_bit	S1SPDR_str.bit_spdr
#define S1SPCCR_str (*((volatile spccr_bits1*)0xE003000C)) 
#define S1SPCCR		S1SPCCR_str.reg_spccr
#define S1SPCCR_bit	S1SPCCR_str.bit_spccr
#define S1SPINT_str (*((volatile spint_bits1*)0xE003001C)) 
#define S1SPINT		S1SPINT_str.reg_spint
#define S1SPINT_bit	S1SPINT_str.bit_spint

/***************************************************************************
 **
 ** SSP
 **
 ***************************************************************************/
#define SSPCR0_str (*((volatile sspcr0_bits*)0xE005C000))
#define SSPCR0		SSPCR0_str.reg_sspcr0
#define SSPCR0_bit	SSPCR0_str.bit_sspcr0
#define SSPCR1_str (*((volatile sspcr1_bits*)0xE005C004))	 
#define SSPCR1		SSPCR1_str.reg_sspcr1
#define SSPCR1_bit	SSPCR1_str.bit_sspcr1
#define SSPDR_str (*((volatile sspdr_bits*)0xE005C008))  
#define SSPDR		SSPDR_str.reg_sspdr
#define SSPDR_bit	SSPDR_str.bit_sspdr
#define SSPSR_str (*((volatile sspsr_bits*)0xE005C00C)) 
#define SSPSR		SSPSR_str.reg_sspsr
#define SSPSR_bit	SSPSR_str.bit_sspsr
#define SSPCPSR_str (*((volatile sspcpsr_bits*)0xE005C010))
#define SSPCPSR		SSPCPSR_str.reg_sspcpsr
#define SSPCPSR_bit	SSPCPSR_str.bit_sspcpsr
#define SSPIMSC_str (*((volatile sspimsc_bits*)0xE005C014))
#define SSPIMSC		SSPIMSC_str.reg_sspimsc
#define SSPIMSC_bit	SSPIMSC_str.bit_sspimsc
#define SSPRIS_str (*((volatile sspris_bits*)0xE005C018))	
#define SSPRIS		SSPRIS_str.reg_sspris
#define SSPRIS_bit	SSPRIS_str.bit_sspris
#define SSPMIS_str (*((volatile sspmis_bits*)0xE005C01C))	
#define SSPMIS		SSPMIS_str.reg_sspmis
#define SSPMIS_bit	SSPMIS_str.bit_sspmis
#define SSPICR_str (*((volatile sspicr_bits*)0xE005C020))
#define SSPICR		SSPICR_str.reg_sspicr
#define SSPICR_bit	SSPICR_str.bit_sspicr

/***************************************************************************
 **
 ** CAN
 **
 ***************************************************************************/

#define AFMR_str (*((volatile afmr_bits*)0xE003C000))
#define AFMR		AFMR_str.reg_afmr
#define AFMR_bit	AFMR_str.bit_afmr
#define SFF_sa (*((REG32 *)0xE003C004))
#define SFF_GRP_sa (*((REG32 *)0xE003C008))
#define EFF_sa (*((REG32 *)0xE003C00C))
#define EFF_GRP_sa (*((REG32 *)0xE003C010))
#define ENDofTable (*((REG32 *)0xE003C014))
#define LUTerrAd (*((REG32 *)0xE003C018))

#define LUTerr (*((REG32 *)0xE003C01C))
#define CANTxSR_str (*((volatile cantxsr_bits*)0xE0040000))
#define CANTxSR	    	CANTxSR_str.reg_cantxsr
#define CANTxSR_bit	    CANTxSR_str.bit_cantxsr
#define CANRxSR_str (*((volatile canrxsr_bits*)0xE0040004))
#define CANRxSR	    	CANRxSR_str.reg_canrxsr
#define CANRxSR_bit	    CANRxSR_str.bit_canrxsr
#define CANMSR_str (*((volatile canmsr_bits*)0xE0040008))
#define CANMSR	    	CANMSR_str.reg_canmsr
#define CANMSR_bit	    CANMSR_str.bit_canmsr

#define C1MOD_str (*((volatile canmod_bits1*)0xE0044000))
#define C1MOD		C1MOD_str.reg_canmod
#define C1MOD_bit	C1MOD_str.bit_canmod
#define C1CMR_str (*((volatile cancmr_bits1*)0xE0044004))
#define C1CMR		C1CMR_str.reg_cancmr
#define C1CMR_bit	C1CMR_str.bit_cancmr
#define C1GSR_str (*((volatile cangsr_bits1*)0xE0044008))
#define C1GSR		C1GSR_str.reg_cangsr
#define C1GSR_bit	C1GSR_str.bit_cangsr
#define C1ICR_str (*((volatile canicr_bits1*)0xE004400C))
#define C1ICR		C1ICR_str.reg_canicr
#define C1ICR_bit	C1ICR_str.bit_canicr
#define C1IER_str (*((volatile canier_bits1*)0xE0044010))
#define C1IER		C1IER_str.reg_canier
#define C1IER_bit	C1IER_str.bit_canier
#define C1BTR_str (*((volatile canbtr_bits1*)0xE0044014))
#define C1BTR		C1BTR_str.reg_canbtr
#define C1BTR_bit	C1BTR_str.bit_canbtr
#define C1EWL_str (*((volatile canewl_bits1*)0xE0044018))
#define C1EWL		C1EWL_str.reg_canewl
#define C1EWL_bit	C1EWL_str.bit_canewl
#define C1SR_str (*((volatile cansr_bits1*)0xE004401C))
#define C1SR		C1SR_str.reg_cansr
#define C1SR_bit	C1SR_str.bit_cansr
#define C1RFS_str (*((volatile canrfs_bits1*)0xE0044020))
#define C1RFS		C1RFS_str.reg_canrfs
#define C1RFS_bit	C1RFS_str.bit_canrfs
#define C1RID_str (*((volatile canrid_bits1*)0xE0044024))
#define C1RID			 C1RID_str.reg_canrid
#define C1RID_ID10_0     C1RID_str.bit_canrid.ID10.ID10_0
#define C1RID_ID29_18    C1RID_str.bit_canrid.ID2918.ID29_18
#define C1RID_ID29_0     C1RID_str.bit_canrid.ID290.ID29_0
#define C1RDA_str (*((volatile canrda_bits1*)0xE0044028))
#define C1RDA		C1RDA_str.reg_canrda
#define C1RDA_bit	C1RDA_str.bit_canrda
#define C1RDB_str (*((volatile canrdb_bits1*)0xE004402C))
#define C1RDB		C1RDB_str.reg_canrdb
#define C1RDB_bit	C1RDB_str.bit_canrdb
#define C1TFI1_str (*((volatile cantfi_bits11*)0xE0044030))
#define C1TFI1		C1TFI1_str.reg_cantfi
#define C1TFI1_bit	C1TFI1_str.bit_cantfi
#define C1TID1_str (*((volatile cantid_bits11*)0xE0044034))
#define C1TID1		 	  C1TID1_str.reg_cantid
#define C1TID1_ID10_0     C1TID1_str.bit_cantid.ID10.ID10_0
#define C1TID1_ID29_18    C1TID1_str.bit_cantid.ID2918.ID29_18
#define C1TID1_ID29_0     C1TID1_str.bit_cantid.ID290.ID29_0
#define C1TDA1_str (*((volatile cantda_bits11*)0xE0044038))
#define C1TDA1		C1TDA1_str.reg_cantda
#define C1TDA1_bit	C1TDA1_str.bit_cantda
#define C1TDB1_str (*((volatile cantdb_bits11*)0xE004403C))
#define C1TDB1		C1TDB1_str.reg_cantdb
#define C1TDB1_bit	C1TDB1_str.bit_cantdb
#define C1TFI2_str (*((volatile cantfi_bits12*)0xE0044040))
#define C1TFI2		C1TFI2_str.reg_cantfi
#define C1TFI2_bit	C1TFI2_str.bit_cantfi
#define C1TID2_str (*((volatile cantid_bits12*)0xE0044044))
#define C1TID2		 	  C1TID2_str.reg_cantid
#define C1TID2_ID10_0     C1TID2_str.bit_cantid.ID10.ID10_0
#define C1TID2_ID29_18    C1TID2_str.bit_cantid.ID2918.ID29_18
#define C1TID2_ID29_0     C1TID2_str.bit_cantid.ID290.ID29_0
#define C1TDA2_str (*((volatile cantda_bits12*)0xE0044048))
#define C1TDA2		C1TDA2_str.reg_cantda
#define C1TDA2_bit	C1TDA2_str.bit_cantda
#define C1TDB2_str (*((volatile cantdb_bits12*)0xE004404C))
#define C1TDB2		C1TDB2_str.reg_cantdb
#define C1TDB2_bit	C1TDB2_str.bit_cantdb
#define C1TFI3_str (*((volatile cantfi_bits13*)0xE0044050))
#define C1TFI3		C1TFI3_str.reg_cantfi
#define C1TFI3_bit	C1TFI3_str.bit_cantfi
#define C1TID3_str (*((volatile cantid_bits13*)0xE0044054))
#define C1TID3		 	  C1TID3_str.reg_cantid
#define C1TID3_ID10_0     C1TID3_str.bit_cantid.ID10.ID10_0
#define C1TID3_ID29_18    C1TID3_str.bit_cantid.ID2918.ID29_18
#define C1TID3_ID29_0     C1TID3_str.bit_cantid.ID290.ID29_0
#define C1TDA3_str (*((volatile cantda_bits13*)0xE0044058))
#define C1TDA3		C1TDA3_str.reg_cantda
#define C1TDA3_bit	C1TDA3_str.bit_cantda
#define C1TDB3_str (*((volatile cantdb_bits13*)0xE004405C))
#define C1TDB3		C1TDB3_str.reg_cantdb
#define C1TDB3_bit	C1TDB3_str.bit_cantdb

#define C2MOD_str (*((volatile canmod_bits2*)0xE0048000))
#define C2MOD		C2MOD_str.reg_canmod
#define C2MOD_bit	C2MOD_str.bit_canmod
#define C2CMR_str (*((volatile cancmr_bits2*)0xE0048004))
#define C2CMR		C2CMR_str.reg_cancmr
#define C2CMR_bit	C2CMR_str.bit_cancmr
#define C2GSR_str (*((volatile cangsr_bits2*)0xE0048008))
#define C2GSR		C2GSR_str.reg_cangsr
#define C2GSR_bit	C2GSR_str.bit_cangsr
#define C2ICR_str (*((volatile canicr_bits2*)0xE004800C))
#define C2ICR		C2ICR_str.reg_canicr
#define C2ICR_bit	C2ICR_str.bit_canicr
#define C2IER_str (*((volatile canier_bits2*)0xE0048010))
#define C2IER		C2IER_str.reg_canier
#define C2IER_bit	C2IER_str.bit_canier
#define C2BTR_str (*((volatile canbtr_bits2*)0xE0048014))
#define C2BTR		C2BTR_str.reg_canbtr
#define C2BTR_bit	C2BTR_str.bit_canbtr
#define C2EWL_str (*((volatile canewl_bits2*)0xE0048018))
#define C2EWL		C2EWL_str.reg_canewl
#define C2EWL_bit	C2EWL_str.bit_canewl
#define C2SR_str (*((volatile cansr_bits2*)0xE004801C))
#define C2SR		C2SR_str.reg_cansr
#define C2SR_bit	C2SR_str.bit_cansr
#define C2RFS_str (*((volatile canrfs_bits2*)0xE0048020))
#define C2RFS		C2RFS_str.reg_canrfs
#define C2RFS_bit	C2RFS_str.bit_canrfs
#define C2RID_str (*((volatile canrid_bits2*)0xE0048024))
#define C2RID		 	 C2RID_str.reg_canrid
#define C2RID_ID10_0     C2RID_str.bit_canrid.ID10.ID10_0
#define C2RID_ID29_18    C2RID_str.bit_canrid.ID2918.ID29_18
#define C2RID_ID29_0     C2RID_str.bit_canrid.ID290.ID29_0
#define C2RDA_str (*((volatile canrda_bits2*)0xE0048028))
#define C2RDA		C2RDA_str.reg_canrda
#define C2RDA_bit	C2RDA_str.bit_canrda
#define C2RDB_str (*((volatile canrdb_bits2*)0xE004802C))
#define C2RDB		C2RDB_str.reg_canrdb
#define C2RDB_bit	C2RDB_str.bit_canrdb
#define C2TFI1_str (*((volatile cantfi_bits21*)0xE0048030))
#define C2TFI1		C2TFI1_str.reg_cantfi
#define C2TFI1_bit	C2TFI1_str.bit_cantfi
#define C2TID1_str (*((volatile cantid_bits21*)0xE0048034))
#define C2TID1		 	  C2TID1_str.reg_cantid
#define C2TID1_ID10_0     C2TID1_str.bit_cantid.ID10.ID10_0
#define C2TID1_ID29_18    C2TID1_str.bit_cantid.ID2918.ID29_18
#define C2TID1_ID29_0     C2TID1_str.bit_cantid.ID290.ID29_0
#define C2TDA1_str (*((volatile cantda_bits21*)0xE0048038))
#define C2TDA1		C2TDA1_str.reg_cantda
#define C2TDA1_bit	C2TDA1_str.bit_cantda
#define C2TDB1_str (*((volatile cantdb_bits21*)0xE004803C))
#define C2TDB1		C2TDB1_str.reg_cantdb
#define C2TDB1_bit	C2TDB1_str.bit_cantdb
#define C2TFI2_str (*((volatile cantfi_bits22*)0xE0048040))
#define C2TFI2		C2TFI2_str.reg_cantfi
#define C2TFI2_bit	C2TFI2_str.bit_cantfi
#define C2TID2_str (*((volatile cantid_bits22*)0xE0048044)) 
#define C2TID2		 	  C2TID2_str.reg_cantid
#define C2TID2_ID10_0     C2TID2_str.bit_cantid.ID10.ID10_0
#define C2TID2_ID29_18    C2TID2_str.bit_cantid.ID2918.ID29_18
#define C2TID2_ID29_0     C2TID2_str.bit_cantid.ID290.ID29_0
#define C2TDA2_str (*((volatile cantda_bits22*)0xE0048048))
#define C2TDA2		C2TDA2_str.reg_cantda
#define C2TDA2_bit	C2TDA2_str.bit_cantda
#define C2TDB2_str (*((volatile cantdb_bits22*)0xE004804C))
#define C2TDB2		C2TDB2_str.reg_cantdb
#define C2TDB2_bit	C2TDB2_str.bit_cantdb
#define C2TFI3_str (*((volatile cantfi_bits23*)0xE0048050))
#define C2TFI3		C2TFI3_str.reg_cantfi
#define C2TFI3_bit	C2TFI3_str.bit_cantfi
#define C2TID3_str (*((volatile cantid_bits23*)0xE0048054))
#define C2TID3		 	  C2TID3_str.reg_cantid
#define C2TID3_ID10_0     C2TID3_str.bit_cantid.ID10.ID10_0
#define C2TID3_ID29_18    C2TID3_str.bit_cantid.ID2918.ID29_18
#define C2TID3_ID29_0     C2TID3_str.bit_cantid.ID290.ID29_0
#define C2TDA3_str (*((volatile cantda_bits23*)0xE0048058))
#define C2TDA3		C2TDA3_str.reg_cantda
#define C2TDA3_bit	C2TDA3_str.bit_cantda
#define C2TDB3_str (*((volatile cantdb_bits23*)0xE004805C))
#define C2TDB3		C2TDB3_str.reg_cantdb
#define C2TDB3_bit	C2TDB3_str.bit_cantdb

#define C3MOD_str (*((volatile canmod_bits3*)0xE004C000))
#define C3MOD		C3MOD_str.reg_canmod
#define C3MOD_bit	C3MOD_str.bit_canmod
#define C3CMR_str (*((volatile cancmr_bits3*)0xE004C004))
#define C3CMR		C3CMR_str.reg_cancmr
#define C3CMR_bit	C3CMR_str.bit_cancmr
#define C3GSR_str (*((volatile cangsr_bits3*)0xE004C008))
#define C3GSR		C3GSR_str.reg_cangsr
#define C3GSR_bit	C3GSR_str.bit_cangsr
#define C3ICR_str (*((volatile canicr_bits3*)0xE004C00C))
#define C3ICR		C3ICR_str.reg_canicr
#define C3ICR_bit	C3ICR_str.bit_canicr
#define C3IER_str (*((volatile canier_bits3*)0xE004C010))
#define C3IER		C3IER_str.reg_canier
#define C3IER_bit	C3IER_str.bit_canier
#define C3BTR_str (*((volatile canbtr_bits3*)0xE004C014))
#define C3BTR		C3BTR_str.reg_canbtr
#define C3BTR_bit	C3BTR_str.bit_canbtr
#define C3EWL_str (*((volatile canewl_bits3*)0xE004C018))
#define C3EWL		C3EWL_str.reg_canewl
#define C3EWL_bit	C3EWL_str.bit_canewl
#define C3SR_str (*((volatile cansr_bits3*)0xE004C01C))
#define C3SR		C3SR_str.reg_cansr
#define C3SR_bit	C3SR_str.bit_cansr
#define C3RFS_str (*((volatile canrfs_bits3*)0xE004C020))
#define C3RFS		C3RFS_str.reg_canrfs
#define C3RFS_bit	C3RFS_str.bit_canrfs
#define C3RID_str (*((volatile canrid_bits3*)0xE004C024))
#define C3RID		 	 C3RID_str.reg_canrid
#define C3RID_ID10_0     C3RID_str.bit_canrid.ID10.ID10_0
#define C3RID_ID29_18    C3RID_str.bit_canrid.ID2918.ID29_18
#define C3RID_ID29_0     C3RID_str.bit_canrid.ID290.ID29_0
#define C3RDA_str (*((volatile canrda_bits3*)0xE004C028))
#define C3RDA		C3RDA_str.reg_canrda
#define C3RDA_bit	C3RDA_str.bit_canrda
#define C3RDB_str (*((volatile canrdb_bits3*)0xE004C02C))
#define C3RDB		C3RDB_str.reg_canrdb
#define C3RDB_bit	C3RDB_str.bit_canrdb
#define C3TFI1_str (*((volatile cantfi_bits31*)0xE004C030))
#define C3TFI1		C3TFI1_str.reg_cantfi
#define C3TFI1_bit	C3TFI1_str.bit_cantfi
#define C3TID1_str (*((volatile cantid_bits31*)0xE004C034))
#define C3TID1		 	  C3TID1_str.reg_cantid
#define C3TID1_ID10_0     C3TID1_str.bit_cantid.ID10.ID10_0
#define C3TID1_ID29_18    C3TID1_str.bit_cantid.ID2918.ID29_18
#define C3TID1_ID29_0     C3TID1_str.bit_cantid.ID290.ID29_0
#define C3TDA1_str (*((volatile cantda_bits31*)0xE004C038))
#define C3TDA1		C3TDA1_str.reg_cantda
#define C3TDA1_bit	C3TDA1_str.bit_cantda
#define C3TDB1_str (*((volatile cantdb_bits31*)0xE004C03C))
#define C3TDB1		C3TDB1_str.reg_cantdb
#define C3TDB1_bit	C3TDB1_str.bit_cantdb
#define C3TFI2_str (*((volatile cantfi_bits32*)0xE004C040))
#define C3TFI2		C3TFI2_str.reg_cantfi
#define C3TFI2_bit	C3TFI2_str.bit_cantfi
#define C3TID2_str (*((volatile cantid_bits32*)0xE004C044))
#define C3TID2		 	  C3TID2_str.reg_cantid
#define C3TID2_ID10_0     C3TID2_str.bit_cantid.ID10.ID10_0
#define C3TID2_ID29_18    C3TID2_str.bit_cantid.ID2918.ID29_18
#define C3TID2_ID29_0     C3TID2_str.bit_cantid.ID290.ID29_0
#define C3TDA2_str (*((volatile cantda_bits32*)0xE004C048))
#define C3TDA2		C3TDA2_str.reg_cantda
#define C3TDA2_bit	C3TDA2_str.bit_cantda
#define C3TDB2_str (*((volatile cantdb_bits32*)0xE004C04C))
#define C3TDB2		C3TDB2_str.reg_cantdb
#define C3TDB2_bit	C3TDB2_str.bit_cantdb
#define C3TFI3_str (*((volatile cantfi_bits33*)0xE004C050))
#define C3TFI3		C3TFI3_str.reg_cantfi
#define C3TFI3_bit	C3TFI3_str.bit_cantfi
#define C3TID3_str (*((volatile cantid_bits33*)0xE004C054))
#define C3TID3		 	  C3TID3_str.reg_cantid
#define C3TID3_ID10_0     C3TID3_str.bit_cantid.ID10.ID10_0
#define C3TID3_ID29_18    C3TID3_str.bit_cantid.ID2918.ID29_18
#define C3TID3_ID29_0     C3TID3_str.bit_cantid.ID290.ID29_0
#define C3TDA3_str (*((volatile cantda_bits33*)0xE004C058))
#define C3TDA3		C3TDA3_str.reg_cantda
#define C3TDA3_bit	C3TDA3_str.bit_cantda
#define C3TDB3_str (*((volatile cantdb_bits33*)0xE004C05C))
#define C3TDB3		C3TDB3_str.reg_cantdb
#define C3TDB3_bit	C3TDB3_str.bit_cantdb

