RuinaLab/Ranger/Robot_Nervous_System/LPC2xxx_Modules/mod_header/LPC2194_01.h
#define C4MOD_str (*((volatile canmod_bits4*)0xE0050000))
#define C4MOD		C4MOD_str.reg_canmod
#define C4MOD_bit	C4MOD_str.bit_canmod
#define C4CMR_str (*((volatile cancmr_bits4*)0xE0050004))
#define C4CMR		C1CMR_str.reg_cancmr
#define C4CMR_bit	C1CMR_str.bit_cancmr
#define C4GSR_str (*((volatile cangsr_bits4*)0xE0050008))
#define C4GSR		C4GSR_str.reg_cangsr
#define C4GSR_bit	C4GSR_str.bit_cangsr
#define C4ICR_str (*((volatile canicr_bits4*)0xE005000C))
#define C4ICR		C4ICR_str.reg_canicr
#define C4ICR_bit	C4ICR_str.bit_canicr
#define C4IER_str (*((volatile canier_bits4*)0xE0050010))
#define C4IER		C4IER_str.reg_canier
#define C4IER_bit	C4IER_str.bit_canier
#define C4BTR_str (*((volatile canbtr_bits4*)0xE0050014))
#define C4BTR		C4BTR_str.reg_canbtr
#define C4BTR_bit	C4BTR_str.bit_canbtr
#define C4EWL_str (*((volatile canewl_bits4*)0xE0050018))
#define C4EWL		C4EWL_str.reg_canewl
#define C4EWL_bit	C4EWL_str.bit_canewl
#define C4SR_str (*((volatile cansr_bits4*)0xE005001C))
#define C4SR		C4SR_str.reg_cansr
#define C4SR_bit	C4SR_str.bit_cansr
#define C4RFS_str (*((volatile canrfs_bits4*)0xE0050020))
#define C4RFS		C4RFS_str.reg_canrfs
#define C4RFS_bit	C4RFS_str.bit_canrfs
#define C4RID_str (*((volatile canrid_bits4*)0xE0050024))
#define C4RID		 	 C4RID_str.reg_canrid
#define C4RID_ID10_0     C4RID_str.bit_canrid.ID10.ID10_0
#define C4RID_ID29_18    C4RID_str.bit_canrid.ID2918.ID29_18
#define C4RID_ID29_0     C4RID_str.bit_canrid.ID290.ID29_0
#define C4RDA_str (*((volatile canrda_bits4*)0xE0050028))
#define C4RDA		C4RDA_str.reg_canrda
#define C4RDA_bit	C4RDA_str.bit_canrda
#define C4RDB_str (*((volatile canrdb_bits4*)0xE005002C))
#define C4RDB		C4RDB_str.reg_canrdb
#define C4RDB_bit	C4RDB_str.bit_canrdb
#define C4TFI1_str (*((volatile cantfi_bits41*)0xE0050030))
#define C4TFI1		C4TFI1_str.reg_cantfi
#define C4TFI1_bit	C4TFI1_str.bit_cantfi
#define C4TID1_str (*((volatile cantid_bits41*)0xE0050034))
#define C4TID1		 	  C4TID1_str.reg_cantid
#define C4TID1_ID10_0     C4TID1_str.bit_cantid.ID10.ID10_0
#define C4TID1_ID29_18    C4TID1_str.bit_cantid.ID2918.ID29_18
#define C4TID1_ID29_0     C4TID1_str.bit_cantid.ID290.ID29_0
#define C4TDA1_str (*((volatile cantda_bits41*)0xE0050038))
#define C4TDA1		C4TDA1_str.reg_cantda
#define C4TDA1_bit	C4TDA1_str.bit_cantda
#define C4TDB1_str (*((volatile cantdb_bits41*)0xE005003C))
#define C4TDB1		C4TDB1_str.reg_cantdb
#define C4TDB1_bit	C4TDB1_str.bit_cantdb
#define C4TFI2_str (*((volatile cantfi_bits42*)0xE0050040))
#define C4TFI2		C4TFI2_str.reg_cantfi
#define C4TFI2_bit	C4TFI2_str.bit_cantfi
#define C4TID2_str (*((volatile cantid_bits42*)0xE0050044))
#define C4TID2		 	  C4TID2_str.reg_cantid
#define C4TID2_ID10_0     C4TID2_str.bit_cantid.ID10.ID10_0
#define C4TID2_ID29_18    C4TID2_str.bit_cantid.ID2918.ID29_18
#define C4TID2_ID29_0     C4TID2_str.bit_cantid.ID290.ID29_0
#define C4TDA2_str (*((volatile cantda_bits42*)0xE0050048))
#define C4TDA2		C4TDA2_str.reg_cantda
#define C4TDA2_bit	C4TDA2_str.bit_cantda
#define C4TDB2_str (*((volatile cantdb_bits42*)0xE005004C))
#define C4TDB2		C4TDB2_str.reg_cantdb
#define C4TDB2_bit	C4TDB2_str.bit_cantdb
#define C4TFI3_str (*((volatile cantfi_bits43*)0xE0050050))
#define C4TFI3		C4TFI3_str.reg_cantfi
#define C4TFI3_bit	C4TFI3_str.bit_cantfi
#define C4TID3_str (*((volatile cantid_bits43*)0xE0050054))
#define C4TID3		 	  C4TID3_str.reg_cantid
#define C4TID3_ID10_0     C4TID3_str.bit_cantid.ID10.ID10_0
#define C4TID3_ID29_18    C4TID3_str.bit_cantid.ID2918.ID29_18
#define C4TID3_ID29_0     C4TID3_str.bit_cantid.ID290.ID29_0
#define C4TDA3_str (*((volatile cantda_bits43*)0xE0050058))
#define C4TDA3		C4TDA3_str.reg_cantda
#define C4TDA3_bit	C4TDA3_str.bit_cantda
#define C4TDB3_str (*((volatile cantdb_bits43*)0xE005005C))
#define C4TDB3		C4TDB3_str.reg_cantdb
#define C4TDB3_bit	C4TDB3_str.bit_cantdb

/***************************************************************************
 **
 ** TIMER0
 **
 ***************************************************************************/
#define T0IR_str (*((volatile ir_bits0*)0xE0004000))
#define T0IR	    	T0IR_str.reg_ir
#define T0IR_bit	    T0IR_str.bit_ir
#define T0TCR_str (*((volatile tcr_bits0*)0xE0004004))
#define T0TCR	    	T0TCR_str.reg_tcr
#define T0TCR_bit	    T0TCR_str.bit_tcr
#define T0TC (*((REG32 *)0xE0004008))
#define T0PR (*((REG32 *)0xE000400c))
#define T0PC (*((REG32 *)0xE0004010))
#define T0MCR_str (*((volatile mcr_bits0*)0xE0004014))
#define T0MCR	    	T0MCR_str.reg_mcr
#define T0MCR_bit	    T0MCR_str.bit_mcr
#define T0MR0 (*((REG32 *)0xE0004018))
#define T0MR1 (*((REG32 *)0xE000401C))
#define T0MR2 (*((REG32 *)0xE0004020))
#define T0MR3 (*((REG32 *)0xE0004024))
#define T0CCR_str (*((volatile ccr0_bits*)0xE0004028))
#define T0CCR	    	T0CCR_str.reg_ccr0
#define T0CCR_bit	    T0CCR_str.bit_ccr0
#define T0CR0 (*((REG32 *)0xE000402C))
#define T0CR1 (*((REG32 *)0xE0004030))
#define T0CR2 (*((REG32 *)0xE0004034))
#define T0CR3 (*((REG32 *)0xE0004038))
#define T0EMR_str (*((volatile emr_bits0*)0xE000403c))
#define T0EMR	    	T0EMR_str.reg_emr
#define T0EMR_bit	    T0EMR_str.bit_emr
#define T0CTCR_str (*((volatile ctcr_bits0*)0xE0004070))
#define T0CTCR	    	T0CTCR_str.reg_ctcr
#define T0CTCR_bit	    T0CTCR_str.bit_ctcr


/***************************************************************************
 **
 ** TIMER1
 **
 ***************************************************************************/
#define T1IR_str (*((volatile ir_bits1*)0xE0008000))
#define T1IR	    	T1IR_str.reg_ir
#define T1IR_bit	    T1IR_str.bit_ir
#define T1TCR_str (*((volatile tcr_bits1*)0xE0008004))
#define T1TCR	    	T1TCR_str.reg_tcr
#define T1TCR_bit	    T1TCR_str.bit_tcr
#define T1TC (*((REG32 *)0xE0008008))
#define T1PR (*((REG32 *)0xE000800c))
#define T1PC (*((REG32 *)0xE0008010))
#define T1MCR_str (*((volatile mcr_bits1*)0xE0008014))
#define T1MCR	    	T1MCR_str.reg_mcr
#define T1MCR_bit	    T1MCR_str.bit_mcr
#define T1MR0 (*((REG32 *)0xE0008018))
#define T1MR1 (*((REG32 *)0xE000801C))
#define T1MR2 (*((REG32 *)0xE0008020))
#define T1MR3 (*((REG32 *)0xE0008024))
#define T1CCR_str (*((volatile ccr1_bits*)0xE0008028))
#define T1CCR	    	T1CCR_str.reg_ccr1
#define T1CCR_bit	    T1CCR_str.bit_ccr1
#define T1CR0 (*((REG32 *)0xE000802C))
#define T1CR1 (*((REG32 *)0xE0008030))
#define T1CR2 (*((REG32 *)0xE0008034))
#define T1CR3 (*((REG32 *)0xE0008038))
#define T1EMR_str (*((volatile emr_bits1*)0xE000803c))
#define T1EMR	    	T1EMR_str.reg_emr
#define T1EMR_bit	    T1EMR_str.bit_emr
#define T1CTCR_str (*((volatile ctcr_bits1*)0xE0008070))
#define T1CTCR	    	T1CTCR_str.reg_ctcr
#define T1CTCR_bit	    T1CTCR_str.bit_ctcr


/***************************************************************************
 **
 ** PWM
 **
 ***************************************************************************/
#define PWMIR_str (*((volatile pwmir_bits*)0xE0014000))
#define PWMIR	    	PWMIR_str.reg_pwmir
#define PWMIR_bit	    PWMIR_str.bit_pwmir
#define PWMTCR_str (*((volatile pwmtcr_bits*)0xE0014004))
#define PWMTCR	    	PWMTCR_str.reg_pwmtcr
#define PWMTCR_bit	    PWMTCR_str.bit_pwmtcr
#define PWMTC (*((REG32 *)0xE0014008))
#define PWMPR (*((REG32 *)0xE001400C))
#define PWMPC (*((REG32 *)0xE0014010))
#define PWMMCR_str (*((volatile pwmmcr_bits*)0xE0014014))
#define PWMMCR	    	PWMMCR_str.reg_pwmmcr
#define PWMMCR_bit	    PWMMCR_str.bit_pwmmcr
#define PWMMR0 (*((REG32 *)0xE0014018))
#define PWMMR1 (*((REG32 *)0xE001401C))
#define PWMMR2 (*((REG32 *)0xE0014020))
#define PWMMR3 (*((REG32 *)0xE0014024))
#define PWMMR4 (*((REG32 *)0xE0014040))
#define PWMMR5 (*((REG32 *)0xE0014044))
#define PWMMR6 (*((REG32 *)0xE0014048))
#define PWMPCR_str (*((volatile pwmpcr_bits*)0xE001404C))
#define PWMPCR	    	PWMPCR_str.reg_pwmpcr
#define PWMPCR_bit	    PWMPCR_str.bit_pwmpcr
#define PWMLER_str (*((volatile pwmler_bits*)0xE0014050))
#define PWMLER	    	PWMLER_str.reg_pwmler
#define PWMLER_bit	    PWMLER_str.bit_pwmler


/***************************************************************************
 **
 ** A/D Converter
 **
 ***************************************************************************/
#define ADCR_str (*((volatile adcr_bits*)0xE0034000))
#define ADCR	    	ADCR_str.reg_adcr
#define ADCR_bit	    ADCR_str.bit_adcr
#define ADDR_str (*((volatile addr_bits*)0xE0034004))
#define ADDR	    	ADDR_str.reg_addr
#define ADDR_bit	    ADDR_str.bit_addr
#define ADDR0_str (*((volatile addr0_bits*) 0xE0034010))
#define ADDR0			ADDR0_str.reg_addr0
#define ADDR0_bit		ADDR0_str.bit_addr0
#define ADDR1_str (*((volatile addr1_bits*) 0xE0034014))
#define ADDR1			ADDR1_str.reg_addr1
#define ADDR1_bit		ADDR1_str.bit_addr1
#define ADDR2_str (*((volatile addr2_bits*) 0xE0034018))
#define ADDR2			ADDR2_str.reg_addr2
#define ADDR2_bit		ADDR2_str.bit_addr2
#define ADDR3_str (*((volatile addr3_bits*) 0xE003401C))
#define ADDR3			ADDR3_str.reg_addr3
#define ADDR3_bit		ADDR3_str.bit_addr3
#define ADINTEN   (*((volatile unsigned long *) 0xE003400C))


/***************************************************************************
 **
 ** RTC
 **
 ***************************************************************************/
#define ILR_str (*((volatile ilr_bits*)0xE0024000))
#define ILR		   ILR_str.reg_ilr
#define ILR_bit	   ILR_str.bit_ilr
#define CTC_str (*((volatile ctc_bits*)0xE0024004))
#define CTC		   CTC_str.reg_ctc
#define CTC_bit	   CTC_str.bit_ctc
#define CCR_str (*((volatile rtcccr_bits*)0xE0024008))
#define CCR		   CCR_str.reg_rtcccr
#define CCR_bit	   CCR_str.bit_rtcccr
#define CIIR_str (*((volatile ciir_bits*)0xE002400C))
#define CIIR		   CIIR_str.reg_ciir
#define CIIR_bit	   CIIR_str.bit_ciir
#define AMR_str (*((volatile amr_bits*)0xE0024010)) 
#define AMR		   AMR_str.reg_amr
#define AMR_bit	   AMR_str.bit_amr
#define CTIME0_str (*((volatile ctime0_bits*)0xE0024014))
#define CTIME0		   CTIME0_str.reg_ctime0
#define CTIME0_bit	   CTIME0_str.bit_ctime0
#define CTIME1_str (*((volatile ctime1_bits*)0xE0024018))	 
#define CTIME1		   CTIME1_str.reg_ctime1
#define CTIME1_bit	   CTIME1_str.bit_ctime1
#define CTIME2_str (*((volatile ctime2_bits*)0xE002401C))	
#define CTIME2		   CTIME2_str.reg_ctime2
#define CTIME2_bit	   CTIME2_str.bit_ctime2
#define SEC_str (*((volatile sec_bits1*)0xE0024020)) 
#define SEC		   SEC_str.reg_sec
#define SEC_bit	   SEC_str.bit_sec
#define MIN_str (*((volatile min_bits1*)0xE0024024))	 
#define MIN		   MIN_str.reg_min
#define MIN_bit	   MIN_str.bit_min
#define HOUR_str (*((volatile hour_bits1*)0xE0024028))  
#define HOUR		   HOUR_str.reg_hour
#define HOUR_bit	   HOUR_str.bit_hour
#define DOM_str (*((volatile dom_bits1*)0xE002402C))
#define DOM		   DOM_str.reg_dom
#define DOM_bit	   DOM_str.bit_dom
#define DOW_str (*((volatile dow_bits1*)0xE0024030)) 
#define DOW		   DOW_str.reg_dow
#define DOW_bit	   DOW_str.bit_dow
#define DOY_str (*((volatile doy_bits1*)0xE0024034)) 
#define DOY		   DOY_str.reg_doy
#define DOY_bit	   DOY_str.bit_doy
#define MONTH_str (*((volatile month_bits1*)0xE0024038))	
#define MONTH		   MONTH_str.reg_month
#define MONTH_bit	   MONTH_str.bit_month
#define YEAR_str (*((volatile year_bits1*)0xE002403C))   
#define YEAR		   YEAR_str.reg_year
#define YEAR_bit	   YEAR_str.bit_year
#define ALSEC_str (*((volatile sec_bits2*)0xE0024060)) 
#define ALSEC		   ALSEC_str.reg_sec
#define ALSEC_bit	       ALSEC_str.bit_sec
#define ALMIN_str (*((volatile min_bits2*)0xE0024064))  
#define ALMIN		   ALMIN_str.reg_min
#define ALMIN_bit	       ALMIN_str.bit_min
#define ALHOUR_str (*((volatile hour_bits2*)0xE0024068))	
#define ALHOUR		   ALHOUR_str.reg_hour
#define ALHOUR_bit	   ALHOUR_str.bit_hour
#define ALDOM_str (*((volatile dom_bits2*)0xE002406C))  
#define ALDOM		   ALDOM_str.reg_dom
#define ALDOM_bit	   ALDOM_str.bit_dom
#define ALDOW_str (*((volatile dow_bits2*)0xE0024070))   
#define ALDOW		   ALDOW_str.reg_dow
#define ALDOW_bit	   ALDOW_str.bit_dow
#define ALDOY_str (*((volatile doy_bits2*)0xE0024074))   
#define ALDOY		   ALDOY_str.reg_doy
#define ALDOY_bit	   ALDOY_str.bit_doy
#define ALMON_str (*((volatile month_bits2*)0xE0024078))	 
#define ALMON		   ALMON_str.reg_month
#define ALMON_bit	   ALMON_str.bit_month
#define ALYEAR_str (*((volatile year_bits2*)0xE002407C))	
#define ALYEAR		   ILR_str.reg_year
#define ALYEAR_bit	   ILR_str.bit_year
#define PREINT_str (*((volatile preint_bits*)0xE0024080))	
#define PREINT		   PREINT_str.reg_preint
#define PREINT_bit	   PREINT_str.bit_preint
#define PREFRAC_str (*((volatile prefrac_bits*)0xE0024084))  
#define PREFRAC		   PREFRAC_str.reg_prefrac
#define PREFRAC_bit	   PREFRAC_str.bit_prefrac

/***************************************************************************
 **
 ** Watchdog
 **
 ***************************************************************************/
#define WDMOD_str (*((volatile wdmod_bits*)0xE0000000))
#define WDMOD	    	WDMOD_str.reg_wdmod
#define WDMOD_bit	    WDMOD_str.bit_wdmod
#define WDTC (*((REG32 *)0xE0000004))
#define WDFEED_str (*((volatile wdfeed_bits*)0xE0000008))
#define WDFEED	    	WDFEED_str.reg_wdfeed
#define WDFEED_bit	    WDFEED_str.bit_wdfeed
#define WDTV (*((REG32 *)0xE000000C))

/***************************************************************************
 **
 **  Interrupt vector table
 **
 ***************************************************************************/
#define RESETV  0x00  /* Reset                           */
#define UNDEFV  0x04  /* Undefined instruction           */
#define SWIV    0x08  /* Software interrupt              */
#define PABORTV 0x0c  /* Prefetch abort                  */
#define DABORTV 0x10  /* Data abort                      */
#define IRQV    0x18  /* Normal interrupt                */
#define FIQV    0x1c  /* Fast interrupt                  */

/***************************************************************************
 **
 **  VIC Interrupt channels
 **
 ***************************************************************************/
#define VIC_WDT          0  /* Watchdog                           */
#define VIC_SW           1  /* Software interrupts                */
#define VIC_DEBUGRX      2  /* Embedded ICE, DbgCommRx            */
#define VIC_DEBUGTX      3  /* Embedded ICE, DbgCommTx            */
#define VIC_TIMER0       4  /* Timer 0 (Match 0-3 Capture 0-3)    */
#define VIC_TIMER1       5  /* Timer 1 (Match 0-3 Capture 0-3)    */
#define VIC_UART0        6  /* UART 0  (RLS, THRE, RDA, CTI)      */
#define VIC_UART1        7  /* UART 1  (RLS, THRE, RDA, CTI, MSI) */
#define VIC_PWM0         8  /* PWM 0   (Match 0-6 Capture 0-3)    */
#define VIC_I2C          9  /* I2C     (SI)                       */
#define VIC_SPI0        10  /* SPI0    (SPIF, MODF)               */
#define VIC_SPI1        11  /* SPI1    (SPIF, MODF)               */
#define VIC_PLL         12  /* PLL lock (PLOCK)                   */
#define VIC_RTC         13  /* RTC     (RTCCIF, RTCALF)           */
#define VIC_EINT0       14  /* External interrupt 0 (EINT0)       */
#define VIC_EINT1       15  /* External interrupt 1 (EINT1)       */
#define VIC_EINT2       16  /* External interrupt 2 (EINT2)       */
#define VIC_EINT3       17  /* External interrupt 3 (EINT3)       */
#define VIC_AD          18  /* External interrupt 2 (EINT2)       */
#define VIC_CAN_AF      19  /* CAN and Acceptance Filter          */
#define VIC_CAN1TX      20  /* CAN1 Tx                            */
#define VIC_CAN2TX      21  /* CAN2 Tx                            */
//#define VIC_RES       22  /* Reserved                           */
//#define VIC_RES       23  /* Reserved                           */
//#define VIC_RES       24  /* Reserved                           */
//#define VIC_RES       25  /* Reserved                           */
#define VIC_CAN1RX      26  /* CAN1 Rx                            */
#define VIC_CAN2RX      27  /* CAN2 Rx                            */
//#define VIC_RES       28  /* Reserved                           */
//#define VIC_RES       29  /* Reserved                           */
//#define VIC_RES       30  /* Reserved                           */
//#define VIC_RES       31  /* Reserved                           */

#endif    /* LPC2194_01_H */


